{
  "backend/main.mo": "Main Motoko actor implementing user profiles, app settings (location/offset), sermon caching, and app release management with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for location persistence in localStorage, crash prevention with fallback prompts, and default Istanbul location fallback mechanism.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files covering location services, prayer times, weather, settings storage with multi-layer recovery, and UI components with responsive typography utilities.",
  "frontend/docs/android-webview-template.md": "Complete Android Studio WebView wrapper template guide for packaging the web app as native Android APK with JavaScript bridge, notifications, offline caching, and Play Store integration.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light/dark themes, including sidebar, chart, and UI component color tokens with custom radius and border settings.",
  "frontend/index.html": "HTML entry point loading Inter font, app icon, and android-widget-bridge.js script before the main React bundle for WebView widget integration.",
  "frontend/public/android-widget-bridge.js": "Standalone JavaScript bridge providing global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface for Android WebView widget updates via SharedPreferences.",
  "frontend/src/androidPushBridge.d.ts": "TypeScript declarations for the AndroidPush interface that sends expanded prayer-times data (next prayer, daily/weekly arrays with timestamps) from WebView to native Android for SharedPreferences storage, alarm scheduling, and widget updates.",
  "frontend/src/androidWidgetBridge.d.ts": "TypeScript declarations for Android Widget Bridge global functions that update native Android widgets with prayer data using HH:MM time strings and timestamps for next prayer, daily prayers, weekly prayers, and city name.",
  "frontend/src/App.tsx": "Root React component with QueryClient provider, tab navigation, and default location fallback logic that detects missing user location and logs usage of Istanbul default coordinates.",
  "frontend/src/components/AuthButton.tsx": "Empty React component that returns null, likely a placeholder for future authentication functionality.",
  "frontend/src/components/HeaderFlourish.tsx": "React component that displays a decorative Islamic divider flourish image centered in the header, hidden on mobile and semi-transparent on larger screens.",
  "frontend/src/components/MobileTabsNav.tsx": "React component providing mobile tab navigation with five primary tabs (Home, Esmaül Hüsna, Zikirmatik, Ramazan, and overflow menu) with Islamic pattern background and responsive styling.",
  "frontend/src/components/SelectLocationPrompt.tsx": "React component displaying a card prompt with MapPin icon that encourages users to select a location to view prayer times and weather data.",
  "frontend/src/components/TabsOverflowMenu.tsx": "React dropdown menu component for overflow tabs, providing access to 12 additional features (Quran reading, prayer tracker, fasting tracker, nearby mosques, religious days, qibla finder, etc.) with icons.",
  "frontend/src/features/adhkar/adhkarData.ts": "Data file defining morning and evening adhkar items with Arabic text, transliteration, Turkish translation, and repetition counts (Ayetel Kürsi, İhlas, Felak, Nas surahs, and various prayers).",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "React component for morning and evening adhkar (Islamic remembrances) with checkboxes to track completion, reset buttons, and progress indicators, using app settings for persistence.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports a constant string representing the current app version (\"1.0.0\") using semantic versioning, intended to be manually updated before each release.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison functions that parse and compare version strings (e.g., \"1.2.3\") numerically, with fallback to string comparison on parse errors.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "React component that displays a dismissible alert prompting users to update the app when a newer version is available on the Play Store, with per-version dismissal tracking via localStorage.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "LocalStorage utilities for persisting and retrieving the dismissed update version, allowing the update prompt to be hidden until a new version is released.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata (version, store URL) from the backend, returning null gracefully if unavailable.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation hook for admin users to update the latest app release metadata in the backend, with automatic query invalidation on success.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Data definitions and content for Islamic prayers organized by category (travel, healing, abundance, anger, sustenance, general), including Arabic text, transliterations, and Turkish translations.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "React component displaying categorized Islamic prayers (duas) with tabs for different occasions, showing a list of duas that open detailed dialogs with Arabic text, transliteration, and translations.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "React component rendering a single card for one of Allah's 99 names with gradient background, displaying the Arabic name, transliteration, and number with hover/click interactions.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of 99 names of Allah with Arabic text, transliteration, Turkish meanings, and associated duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "React component displaying a grid of all 99 names of Allah (Esmaül Hüsna) as cards, with a dialog that shows detailed meaning and associated prayer when a card is clicked.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Main fasting tracker component that manages voluntary fasts, make-up fasts, and Ramadan day-by-day tracking with date inputs, target counts, and progress displays.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays a 30-day Ramadan fasting checklist with progress bar, day-by-day status buttons (Fasted/Missed), and a reset dialog.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Quran completion (Hatim) tracker that manages current page progress (1-604) with increment/decrement buttons, manual input, progress bar, and reset functionality.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Exports getCurrentPrayerSlot function that determines which prayer time slot (fajr, sunrise, dhuhr, asr, maghrib, isha) is currently active based on adjusted times.",
  "frontend/src/features/home/formatRemainingTime.ts": "Utility function that formats milliseconds into zero-padded countdown strings (mm:ss or HH:mm:ss), clamping negatives to zero.",
  "frontend/src/features/home/HomeTab.tsx": "Main home tab component that orchestrates location selection, prayer times display, weather, weekly prayer times, countdown, and Android widget updates with default location fallback.",
  "frontend/src/features/home/MotifButton.tsx": "Custom button component that wraps the base Button with a subtle Islamic tile pattern overlay for decorative styling.",
  "frontend/src/features/home/MotifFrame.tsx": "Decorative frame component with three variants (default, ornamental with corner decorations, divider with flourish) for wrapping content with Islamic motifs.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Presentational component that displays the next prayer name, time, and countdown (mm:ss or HH:mm:ss format) received from parent to avoid duplicate bridge calls.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays four prayer-time-specific cards (verse, hadith, dua, esma) with click-to-expand dialogs, using current prayer slot to fetch content from hooks.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Shows Ramadan sahur and iftar times with a countdown to the next meal, using a custom hook for countdown logic.",
  "frontend/src/features/home/time-content/duasData.ts": "Static array of 20+ dua items with Arabic text, Turkish translation, and occasion labels for prayer-time-specific content.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Static array of 20+ hadith items with Arabic text, Turkish translation, and source references for prayer-time-specific content.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem interface and exports an array of 24+ Quranic verses with Arabic text, Turkish translations, and references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that sends comprehensive prayer time data (next prayer, daily/weekly schedules with timestamps) to AndroidPush interface, deduplicating updates by comparing JSON payloads.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily and weekly prayer times plus city name to Android widgets via both legacy and new bridge interfaces, deduplicating updates to avoid redundant calls.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks the current prayer time slot (fajr, sunrise, dhuhr, asr, maghrib, isha) and updates every minute when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that computes the next prayer with live per-second countdown, exposing nextPrayer, nextPrayerMillis, and formatted timeRemaining, and sends updates to Android bridge when prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "React hook that selects random verse, hadith, dua, and Esma-ul Husna content for display cards, using the current prayer slot as a seed for stable randomization.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "React hook that calculates countdown to next sahur (fajr) or iftar (maghrib) time based on current time, updating every minute with formatted time remaining.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Renders a table of daily prayer times for the week with sticky first column, highlighting today's row.",
  "frontend/src/features/location/LocationSetupSection.tsx": "React component that provides a location search UI using geocoding, allowing users to search for and select a location which is then saved to multiple storage mechanisms (durable storage, localStorage, and app settings).",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Provides functions to search locations using the Open-Meteo Geocoding API and convert API results to the app's Location type format.",
  "frontend/src/features/location/types.ts": "Defines TypeScript interfaces for Location and GeocodingResult, plus a DEFAULT_LOCATION constant set to Istanbul, Turkey.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that wraps the geocoding search function with caching, automatic refetch control, and a minimum 2-character query requirement.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "React component displaying Islamic prayer (namaz) tutorial with gender-specific instructions, showing daily prayer rakat counts and step-by-step prayer instructions with Arabic text.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Contains structured data for Islamic prayer tutorials including rakat counts for five daily prayers and detailed step-by-step instructions for men and women following Hanafi tradition.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions implementing Haversine formula to calculate great-circle distance between two geographic coordinates and format the result in meters or kilometers.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "React component providing location search UI for finding nearby mosques, with options to use location temporarily or save as default, and displays the currently active location.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Fetches nearby mosques from OpenStreetMap's Overpass API using user coordinates and radius, returning sorted results with calculated distances and address information.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "React component that displays nearby mosques within 5km radius of selected location, integrating location search and showing mosque details with Google Maps links.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface with id, name, coordinates, distance, and optional address fields.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques based on latitude, longitude, and radius with 5-minute cache and conditional enabling.",
  "frontend/src/features/notifications/notificationCopy.ts": "Centralized notification templates for prayer times (Fajr, Dhuhr, Asr, Maghrib, Isha, Sunrise) with formatting utilities for time and lead minutes.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "React component for tracking daily prayer completion and managing kaza (missed prayer) counters with increment/decrement controls and progress display.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from Aladhan API using coordinates and calculation method 13, returning formatted times and date.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "Fetches 7-day prayer times from Aladhan API with Turkish day labels and formatted dates for weekly display.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes three kerahat (forbidden prayer) windows based on sunrise, dhuhr, and maghrib times, and merges them chronologically with prayer times.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays prayer times with icons, supports time offset editing, and integrates kerahat (forbidden prayer) windows into the chronological time list.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to prayer times with 24-hour wraparound, supporting both single times and full prayer time objects.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook for fetching daily prayer times with 30-minute cache, enabled only when location is available.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook for fetching weekly prayer times with 30-minute cache, enabled only when location is available.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays a Qibla (prayer direction) finder using device compass, showing an animated arrow pointing toward Mecca with location setup dialog and permission handling for device orientation.",
  "frontend/src/features/qibla/qiblaMath.ts": "Utility functions for calculating the bearing from any geographic location to the Kaaba in Mecca using great-circle formulas and angle normalization.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that accesses device orientation API to get compass heading, handles iOS 13+ permission requests, and manages support/permission states.",
  "frontend/src/features/quran-reading/quranApi.ts": "API client for fetching Quran data from Al-Quran Cloud API, including surah metadata, Arabic text, Turkish translations, and audio recitation URLs with in-memory caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "React component providing a Quran reader interface with surah list view, ayah-by-ayah audio playback, translation toggle, and reading position persistence.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "React hook managing audio playback for Quran ayahs with controls for play/pause, navigation between ayahs, auto-play next, and error handling.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "React hook that persists and retrieves Quran reading progress (last surah, ayah, and scroll position) using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content defining fasting basics in Turkish, covering what fasting is, who must fast, how to fast, what breaks the fast, and recommended/prohibited behaviors during fasting.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Dataset of 30 daily Ramadan menus (sahur and iftar meals) in Turkish, each containing suggested food items for pre-dawn and evening meals.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "React component that displays Ramadan information including prayer times (imsak/iftar), daily rotating menu, fasting basics, and Tarawih prayer details. Prompts for location setup if not configured.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing Tarawih prayer in Turkish, including number of rakats (20), how to perform it, and notes about Ramadan observance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "React hook that returns a daily rotating Ramadan menu based on day-of-year calculation, automatically updating at midnight using setTimeout/setInterval.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for local date operations including start-of-day normalization, days-between calculation, and Turkish locale date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri calendar events to Gregorian dates for a given year by scanning each day and using browser's Intl API with Islamic calendar support.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Fixed dataset of 2026 Islamic religious days with hardcoded Gregorian dates, Turkish names, and Hijri calendar references for 15 events including Ramadan and Eid celebrations.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "TypeScript type definitions for Hijri events and computed Gregorian religious day instances, including date, display format, and calendar metadata.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "React component displaying 2026 Islamic religious days in Turkish, highlighting the next upcoming event with countdown and showing full yearly list with past/future indicators.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook that returns fixed 2026 religious days data, calculates the next upcoming event, and computes days remaining until that event using local date math.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file with no content.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file with no content.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only component for managing app release metadata (version and Play Store URL) with form inputs, validation, success/error alerts, and immediate UI updates after submission.",
  "frontend/src/features/settings/appSettingsModel.ts": "TypeScript model definitions for app settings including location, prayer times, notifications, zikirmatik, hatim, adhkar, fasting, Ramadan tracking, prayer checklists, kaza counters, and Quran reading progress.",
  "frontend/src/features/settings/durableLocationStorage.ts": "Multi-layer location persistence using IndexedDB as primary storage with localStorage and sessionStorage backups, including validation and error handling for durable location data.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Local storage management for app settings with versioned data migration, manual location persistence, and multi-layer recovery strategy for location data across localStorage and IndexedDB.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI component with cards for general settings (prayer time offset adjustment) and notification lead time configuration for each prayer, using responsive design with mobile-friendly touch targets.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query hook for managing app settings with persistent storage, providing both new awaitable API and legacy compatibility for loading and updating settings with infinite cache.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Defines the TasbihatItem interface and exports an array of Islamic prayer phrases (tasbihat) with Arabic text, transliterations, translations, and target counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "UI component displaying post-prayer tasbihat (glorifications) with Arabic text, transliteration, translation, and repetition counts in scrollable cards with badges.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Renders a compact weather summary component displaying temperature and weather description with a cloud icon, hidden when no location is set.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Provides API integration with Open-Meteo weather service, fetching current weather data and mapping weather codes to Turkish descriptions.",
  "frontend/src/features/weather/useWeather.ts": "Custom React Query hook that fetches weather data for a given location with 10-minute cache and retry logic.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays a detailed weather card with temperature, weather description, wind speed, and humidity information for the user's selected location.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital tasbih (prayer counter) with increment, reset, target setting, and progress tracking functionality, persisting state to app settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validity.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette (jewel tones), prayer time colors, responsive typography utilities, and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/androidBridge.ts": "Provides safe helper functions to communicate with Android WebView bridge for sending prayer time data (next prayer, daily prayers, weekly prayers) to native Android layer with validation and error handling.",
  "frontend/src/utils/nativeNotifications.ts": "Provides interface for triggering native Android notifications via WebView JavaScript bridge with graceful fallback when bridge is unavailable, including prayer-specific and generic notification helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), typography, container queries, animations, and mobile-first responsive breakpoints capped at 1024px.",
  "project_state.json": "Project metadata defining a mobile-responsive prayer times application with localStorage-based location persistence, tracking known issues with cache clearing on mobile devices and feature requests for improving data persistence."
}