{
  "backend/main.mo": "Actor managing user profiles, app settings, sermon cache, and app release info with permission checks via AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to involved files, components, and test IDs for app settings and location persistence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files including settings, location, prayer, weather, and UI components.",
  "frontend/docs/android-webview-template.md": "Guide and template for wrapping the web app in an Android WebView, including JS–Android bridge and notification integration.",
  "frontend/index.css": "Root CSS variables and Tailwind base layers defining light/dark themes, color tokens, and global element styling.",
  "frontend/index.html": "Main HTML entry loading fonts, favicon, Android widget bridge script, and the React app root.",
  "frontend/public/android-widget-bridge.js": "JavaScript bridge exposing global functions for updating Android prayer widgets via WebView interfaces with input validation.",
  "frontend/src/androidPushBridge.d.ts": "Declares the AndroidPush interface for sending detailed prayer-time JSON to the Android WebView wrapper. Includes methods for transferring next, daily, and weekly prayer data.",
  "frontend/src/androidWidgetBridge.d.ts": "Defines global functions and an AndroidPrayer interface for updating Android widgets with next, daily, and weekly prayer times. Provides HH:MM-based update methods and widget-facing APIs.",
  "frontend/src/App.tsx": "React root component implementing tab navigation, decorative backgrounds, header UI, and integration of major feature tabs.",
  "frontend/src/components/AuthButton.tsx": "Exports an AuthButton component that currently renders nothing.",
  "frontend/src/components/HeaderFlourish.tsx": "Renders a centered decorative image flourish used in page headers.",
  "frontend/src/components/MobileTabsNav.tsx": "Implements a mobile tab navigation bar with icons, overflow menu, and tab content areas for many app sections.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Shows a card prompting the user to pick a location, with a button triggering navigation.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Provides a dropdown menu listing additional tabs not shown in the main bar, invoking a callback when a tab is selected.",
  "frontend/src/features/adhkar/adhkarData.ts": "Exports structured morning and evening adhkar arrays defining titles, Arabic text, translations, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "Renders morning and evening adhkar lists with completion tracking, reset actions, and scrollable layout.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Defines the current app version constant used for update checks.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison and a helper to check if a version is newer.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Displays a dismissible update alert when the backend version is newer than the current version and not previously dismissed.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Stores and retrieves dismissed update version info in localStorage.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks via actor whether the current caller has admin privileges.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "Fetches the latest app release metadata from the backend with graceful failure handling.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "Mutation hook to update release metadata and refresh related queries.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Defines dua categories and provides categorized dua data.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "UI for browsing dua categories, listing duas, and viewing details in a dialog.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Renders a stylized card for an Esmaül Hüsna item with Arabic name and transliteration.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of items containing Arabic names, transliterations, Turkish meanings, and related duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays all Esmaül Hüsna items as cards and shows detailed meaning and dua in a dialog.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Implements the fasting tracker UI, allowing users to log voluntary and make-up fasting dates, set targets, and manage Ramadan day statuses.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays a 30‑day Ramadan fasting checklist with progress, day status toggles, and a reset option.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Provides a Quran reading progress tracker where users update their last read page and view progress toward 604 pages.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Computes the current prayer slot by comparing the current time to adjusted prayer times.",
  "frontend/src/features/home/HomeTab.tsx": "Renders the home view showing location selection, adjusted prayer times, weather, weekly times, and next‑prayer countdown with widget updates.",
  "frontend/src/features/home/MotifButton.tsx": "A button wrapper adding an Islamic tile-pattern overlay while preserving standard button variants and behavior.",
  "frontend/src/features/home/MotifFrame.tsx": "A layout wrapper that applies optional ornamental motifs or divider graphics around its children.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Displays the next prayer time and remaining countdown, handling loading and error states.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders a grid of prayer-related content cards with modal details based on current prayer slot.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Shows sahur and iftar times with a live countdown, hidden during loading or errors.",
  "frontend/src/features/home/time-content/duasData.ts": "Provides a list of dua items with Arabic text, Turkish meaning, and usage context.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Contains a dataset of hadith items including Arabic text, Turkish translation, and sources.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports an array of Quran verses with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that builds and sends detailed prayer-time payloads to Android Push, avoiding duplicate sends with cached JSON.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily, weekly prayer times and city name to Android widgets, with deduplication for each payload.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "Tracks the current prayer slot and updates it every minute using getCurrentPrayerSlot.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "Computes next prayer, remaining time, and nextPrayerMillis with minute updates, sending legacy Android bridge notifications when values change.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content per prayer slot using seeded selection.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "Calculates sahur and iftar countdowns based on fajr and maghrib times, updating every minute.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Displays a weekly prayer schedule table with loading and error fallback cards.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching locations via geocoding, displaying results, and saving the selected location into app settings.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Provides functions to search locations using Open-Meteo API and convert geocoding results into internal Location objects.",
  "frontend/src/features/location/types.ts": "Defines TypeScript interfaces for Location and GeocodingResult objects.",
  "frontend/src/features/location/useGeocodingSearch.ts": "Custom React Query hook that performs debounced geocoding searches based on input text.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Renders namaz tutorial content with gender-specific steps and displays daily prayer rakat counts.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Contains structured content for namaz steps and prayer rakat information for men and women.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions for calculating Haversine distances and formatting them for display.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "Component allowing users to search for a temporary or default location to use for nearby mosque searches.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Queries Overpass API for nearby mosques, extracts coordinates and metadata, computes distances, and returns a sorted list.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "Main tab for nearby mosque functionality, handling location selection and displaying mosque results within a radius.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface with ID, name, coordinates, distance, and optional address.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques when location is available and caches results.",
  "frontend/src/features/notifications/notificationCopy.ts": "Contains notification templates for generic and prayer-time alerts with helpers to format messages.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "UI component for tracking daily and missed prayers, allowing toggles and counter adjustments stored in settings.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from the Aladhan API and formats the response.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "Fetches a week's prayer times from Aladhan API and builds localized day labels.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes kerahat windows and merges them with prayer times into a sorted timeline.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays prayer times with offsets and kerahat windows, handling loading, errors, and location selection.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to individual or sets of prayer times with wraparound handling.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that retrieves daily prayer times for a given location.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook that retrieves weekly prayer times for a given location.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays Qibla direction using device orientation, handles location selection, and shows UI cards based on state.",
  "frontend/src/features/qibla/qiblaMath.ts": "Utility functions to compute Qibla bearing using great-circle math and normalize angles.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that manages device orientation permissions and returns compass heading data.",
  "frontend/src/features/quran-reading/quranApi.ts": "Frontend API wrapper for fetching surah metadata, content, translations, and audio with caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "Main Qur'an learning tab that loads surah lists, displays reader mode with audio playback, and restores reading state.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "Custom hook providing audio playback controls and state management for ayah-by-ayah recitation.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "Hook that persists and retrieves Qur'an reading progress using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static dataset defining sections of basic fasting information with headings and paragraph arrays. Exported as structured content for display in the Ramadan tab.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Static list of 30 daily Ramadan menus, each with sahur and iftar items. Used for rotating daily meal suggestions.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "React tab component showing Ramadan info, prayer times, location selection, Tarawih content, and a rotating daily menu. Handles missing location state and renders multiple informational sections.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing Tarawih prayer details, including structure and Ramadan-related notes. Exported as title and section list.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook that returns the menu for the current day and updates automatically at midnight. Selects menus deterministically based on day of year.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for day calculations and date formatting in Turkish locale. Provides start-of-day normalization and day-difference logic.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri events to Gregorian dates by scanning the year and matching Intl-formatted Hijri parts. Produces computed religious day objects.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Static predefined list of major Islamic dates in 2026 with Gregorian and Hijri metadata. Used as the dataset for religious day displays.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "Type definitions for Hijri events and computed Gregorian religious days. Provides structure for event conversion and display models.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "UI component rendering 2026 religious days with next upcoming highlight and full list display. Uses computed data from a custom hook for dates and status flags.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook returning 2026 religious days, next upcoming event, and remaining days using memoized date logic.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty placeholder file for a Friday sermon tab component.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty placeholder hook for fetching the latest sermon.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only UI for updating latest app release version and Play Store URL with validation and success/error states.",
  "frontend/src/features/settings/appSettingsModel.ts": "Type definitions for all app settings including location, notifications, fasting, Qur’an progress, and prayer tracking.",
  "frontend/src/features/settings/durableLocationStorage.ts": "IndexedDB-based storage helpers for persisting and retrieving the user’s selected location.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Loads, saves, and migrates app settings using localStorage with fallback to durable location storage.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI allowing users to adjust prayer time offsets and per-prayer notification lead times.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query hook that loads, caches, and updates app settings with local persistence.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Static dataset defining tasbihat items with phrases, Arabic text, translations, and counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "UI component rendering tasbihat items in scrollable cards with Arabic text, transliteration, and translations.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Displays a compact weather snippet showing temperature and description using location-based weather data.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather from Open‑Meteo and maps response fields to an internal WeatherData format with a code-to-text description helper.",
  "frontend/src/features/weather/useWeather.ts": "Provides a React Query hook to fetch and cache weather data based on a selected location.",
  "frontend/src/features/weather/WeatherSection.tsx": "Renders a detailed weather card with temperature, conditions, wind, and humidity, handling loading and error states.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital counter UI with target tracking, progress display, and persistence via app settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and initializes AuthClient with stored or new credentials.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light/dark themes and prayer-specific accents.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/androidBridge.ts": "Offers safe wrappers for calling Android WebView bridge functions to update prayer widgets and daily prayer data.",
  "frontend/src/utils/nativeNotifications.ts": "Provides functions to send native Android notifications via a WebView bridge, with fallbacks when unavailable, plus helpers for generic and prayer notifications and checking bridge support.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL and hash parameters, persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Defines the project’s metadata, architectural notes, known issues, and feature requests related to durable location persistence."
}