{
  "backend/main.mo": "Actor managing user profiles, app settings, sermon cache, and app releases with access control checks for user and admin permissions.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of multiple frontend files describing their purpose and functionality.",
  "frontend/docs/android-webview-template.md": "Documentation providing a minimal Android Studio WebView template for wrapping the web app as a native Android app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, dark mode values, and base element styles.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app root with main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the app shell, navigation, header, and all major tabs with decorative backgrounds.",
  "frontend/src/components/AuthButton.tsx": "Placeholder AuthButton component that returns null.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile tab navigation component using shadcn Tabs with themed backgrounds and overflow menu.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card component prompting users to select a location, with an icon and navigation callback.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Renders an overflow dropdown menu of tab options with icons and calls onSelectTab when an item is chosen.",
  "frontend/src/features/adhkar/adhkarData.ts": "Provides static data arrays for morning and evening adhkar items with text, translations, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "Displays morning and evening adhkar lists with checkboxes and reset controls, persisting completion state via settings.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports the hardcoded current app semantic version string.",
  "frontend/src/features/app-release/semverCompare.ts": "Implements semantic version comparison and a helper to check if one version is newer.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Shows a dismissible update alert when a newer backend app version exists and links to the store page.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Handles storing, retrieving, and clearing dismissed update-version data in localStorage.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook checking admin status via the actor's isCallerAdmin method.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook fetching latest app release metadata from the backend with graceful fallbacks.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "Mutation hook to update latest app release metadata and refresh related queries.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Dua ve kategori tiplerini tanımlar ve çeşitli kategorilere göre dua listesini içerir.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "Renders dua categories and lists, with a dialog showing full details for a selected dua.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Esmaül Hüsna öğelerini kart olarak gösteren ve seçim olayını tetikleyen bir bileşen.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Esmaül Hüsna öğeleri için veri modelini ve 99 isimden oluşan listeyi sağlar.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Esmaül Hüsna listesini kart grid olarak gösterir ve seçilen isim için detay diyaloğu açar.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Nafile ve kaza oruçlarını, hedefleri ve Ramazan gün durumlarını yönetip kaydeden ana takip bileşeni.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Ramazan ayı 30 günlük oruç durumlarını gösteren, ilerlemeyi hesaplayan ve sıfırlama seçeneği sunan arayüz bölümü.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Provides a UI to track Quran reading progress, allowing page input, increment/decrement, reset, and saving to settings.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Calculates the current prayer slot based on adjusted prayer times and helper conversion to minutes.",
  "frontend/src/features/home/HomeTab.tsx": "Displays daily prayer info, next prayer countdown, and weather, with location setup and kerahat-aware prayer times.",
  "frontend/src/features/home/MotifButton.tsx": "Wraps a styled button with an Islamic pattern overlay for decorative UI consistency.",
  "frontend/src/features/home/MotifFrame.tsx": "Renders a frame component with optional ornamental corners or divider flourish around its children.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Shows the upcoming prayer time and countdown, with loading and error handling.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays clickable cards for verse, hadith, dua, and esma content tied to the current prayer slot.",
  "frontend/src/features/home/time-content/duasData.ts": "Contains a list of dua items with Arabic text, Turkish translations, and usage occasions.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Defines a HadithItem interface and exports an array of short hadith entries with Arabic text, Turkish translation, and sources.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports an array of Quran verse entries with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that determines the current prayer slot and updates it every minute.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that finds the next prayer time and calculates remaining time, updating every minute.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and Esma content per prayer slot using a seeded picker.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching, selecting, and saving a user’s location via geocoding results.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Provides functions to search locations using Open-Meteo’s API and convert results into app-specific location objects.",
  "frontend/src/features/location/types.ts": "Defines Location and GeocodingResult TypeScript interfaces.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook for performing debounced geocoding searches with caching and retry logic.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Renders a guided prayer tutorial with rakat info and gender-specific step sequences.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Defines interfaces and data for prayer steps and rakat counts, including detailed male prayer steps and placeholders for female steps.",
  "frontend/src/features/nearbymosque/distance.ts": "Implements Haversine distance calculation and formatting utilities for displaying distances.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "Provides a UI component to search and select a location using geocoding results with temporary or saved options.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Fetches nearby mosques from the Overpass API, extracts details, computes distances, and returns a sorted list.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "Main tab for listing nearby mosques, handling location selection, radius filtering, and search display logic.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque TypeScript interface with ID, name, coordinates, distance, and optional address.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques based on coordinates and radius, with caching and retry logic.",
  "frontend/src/features/notifications/notificationCopy.ts": "Contains notification templates for prayer times and helpers to format messages with optional time/lead info.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "Prayer tracking UI allowing users to mark daily prayers and manage kaza counts stored in app settings.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from the Aladhan API and maps the response to a normalized PrayerTimes object.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes kerahat time windows and merges them with prayer times into a chronologically sorted list.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Renders prayer times with user-configurable offsets and kerahat windows, handling loading, errors, and location selection.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to individual prayer times or an entire prayer time set.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that loads prayer times for a given location with caching and retry logic.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "Provides a UI for locating the Qibla direction using device orientation and user-selected location.",
  "frontend/src/features/qibla/qiblaMath.ts": "Calculates the Qibla bearing from any coordinate using great-circle math and normalizes angles.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "Hook that reads device orientation heading, handling permissions and feature support across platforms.",
  "frontend/src/features/quran-reading/quranApi.ts": "Fetches Qur'an surah metadata, ayah text, translations, and audio with caching via the Al-Quran Cloud API.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "Displays a surah list and reader with audio playback, translation toggling, and persistent reading progress.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "React hook managing audio playback for ayahs, including loading, errors, navigation, and automatic next‑ayah behavior.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "Stores and updates last-read surah, ayah, and scroll position using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content describing fasting basics, rules, and guidance.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Provides structured sahur and iftar menus for each day of Ramadan.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "UI component showing Ramadan info, prayer times, location setup, tarawih info, and daily rotating menu.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content explaining terawih prayer details and practices.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook selecting the current day's Ramadan menu and updating it automatically at midnight.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for day-start normalization, day-difference calculation, and Turkish date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri events to Gregorian dates by scanning a year using Intl Islamic calendar data.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Static dataset of all Islamic days in 2026 with fixed Gregorian dates and Hijri mappings.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "TypeScript interfaces defining Hijri events and computed Gregorian religious day objects.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "React component showing 2026 Islamic days, highlighting the next upcoming day and listing all days with status badges.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "Hook returning 2026 religious days plus the next upcoming day and days remaining.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty placeholder file for the Friday sermon tab component.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty placeholder file for a hook to fetch the latest sermon.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only UI for updating app release version and Play Store URL with validation and success feedback.",
  "frontend/src/features/settings/appSettingsModel.ts": "Type definitions for app settings including location, notifications, fasting, Quran progress, and prayer data.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Defines local settings schema, defaults, and versioned loading with migrations from localStorage.",
  "frontend/src/features/settings/SettingsTab.tsx": "User settings UI for time offset, prayer notifications, and access to admin release controls.",
  "frontend/src/features/settings/useAppSettings.ts": "Provides React Query hooks to load, update, and persist app settings merged with defaults.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Exports static tasbihat items including text, translations, and repetition counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "Renders a scrollable list of tasbihat items with Arabic text, translations, and counts.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Shows a small inline weather summary based on the user’s selected location.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather data from Open‑Meteo and maps weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook to fetch weather data for a given location with caching and retries.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays a detailed weather card with temperature, description, wind, and humidity.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital tasbih counter UI with target settings and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, loading saved identities, and exposing login state.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode colors, and utility background patterns.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/nativeNotifications.ts": "Implements safe wrappers for sending native Android notifications via the WebView bridge and checking support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, layouts, animations, and enabling plugins.",
  "project_state.json": "Describes project state focused on enabling Quran ayah audio playback, listing requirements, issues, and feature requests."
}