{
  "backend/main.mo": "Actor with access control managing user profiles, app settings, sermon cache, and latest app release with admin‑protected updates.",
  "feature_evidence.json": "Feature evidence listing Ramadan checklist enhancements, persistence, and UI requirements with related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files including settings storage, fasting tracker, location, prayer, and weather modules.",
  "frontend/docs/android-webview-template.md": "Guide for creating an Android WebView wrapper app with caching, JS bridge, notifications, and alarm handling.",
  "frontend/index.css": "Tailwind base styles and OKLCH variable color theme for light/dark modes with global resets.",
  "frontend/index.html": "HTML entry file loading fonts, metadata, favicon, and the root React app.",
  "frontend/src/App.tsx": "Main React app with header, weather summary, update prompt, and tab navigation for all feature tabs.",
  "frontend/src/components/AuthButton.tsx": "Placeholder AuthButton component that returns null.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile tab navigation defining primary and overflow tabs and rendering corresponding tab content.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card prompting user to choose a location with a button callback for navigation.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Renders a dropdown menu for overflow tabs, calling onSelectTab when an item is chosen.",
  "frontend/src/features/adhkar/adhkarData.ts": "Defines AdhkarItem and exports static morning and evening adhkar lists with text, translation, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "Displays morning and evening adhkar with checkboxes, progress tracking, and reset actions using saved settings.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports the current hardcoded app version string.",
  "frontend/src/features/app-release/semverCompare.ts": "Implements semantic version comparison and a helper to check if a version is newer.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Shows a dismissible alert when a newer app version is available, linking to the store and remembering dismissals.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Provides localStorage helpers to store and retrieve dismissed update prompt versions.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook checking if the current actor has admin privileges.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "Fetches the latest app release metadata via React Query, handling missing or failing backend responses.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "Mutation hook to update the latest app release and invalidate related queries.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Tanımlar ve kategorilere göre gruplanmış dua veri listelerini içerir.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "Renders a dua guide with category tabs, dua list, and a detail dialog for selected duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Esmaül Hüsna maddelerini renkli kart olarak gösteren ve seçildiğinde detay açan kart bileşeni.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Esmaül Hüsna için id, Arapça, transliterasyon, Türkçe anlam ve dua içeren veri kümesini tanımlar.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Esmaül Hüsna listesini kartlar halinde gösterir ve seçilen ismin detaylarını dialog içinde sunar.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Ramazan, nafile ve kaza oruçlarını ekleme, silme ve hedef belirleme özellikleriyle takip eden ana sekme bileşeni.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Ramazan ayındaki 30 günün tamamlanma durumunu gösteren ilerleme, gün listesi ve sıfırlama işlevi sunar.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Implements a Quran reading progress tracker with page navigation, input validation, and saving settings.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Determines the current prayer slot by comparing the current time to adjusted prayer times.",
  "frontend/src/features/home/HomeTab.tsx": "Renders the home screen showing location selection, next prayer countdown, and prayer times with kerahat integration.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Displays the upcoming prayer and remaining time, using a countdown hook and handling loading/error states.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Shows four prayer-related content cards and opens a dialog with detailed ayet, hadith, dua, or esma content.",
  "frontend/src/features/home/time-content/duasData.ts": "Provides a list of dua items with Arabic text, Turkish meaning, and usage context.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Provides a list of hadith items with Arabic text, Turkish translation, and source references.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports an array of Quran verses with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks and updates the current prayer slot every minute based on adjusted prayer times.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "Provides the next prayer time and a live countdown by calculating remaining minutes until the upcoming prayer.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content per prayer slot using a seeded generator.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching, selecting, and saving a user’s location using geocoding results.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Fetches geocoding results from Open-Meteo API and converts them into internal Location objects.",
  "frontend/src/features/location/types.ts": "Defines Location and GeocodingResult TypeScript interfaces for geocoding and location data.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that performs debounced geocoding searches when the input has at least two characters.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Renders namaz tutorial UI with rekat info and gender-specific step-by-step prayer instructions.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Provides prayer rakat definitions and detailed men’s and women’s namaz steps with optional Arabic text.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions for calculating Haversine distance and formatting it for display.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "Search UI for selecting a location using geocoding results, allowing temporary or saved location selection.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Fetches nearby mosques from Overpass API, parses results, computes distances, and sorts them.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "Main tab showing nearby mosques based on active or temporary location, radius selection, and search integration.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface used for mosque data.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook for fetching and caching nearby mosques based on coordinates and radius.",
  "frontend/src/features/notifications/notificationCopy.ts": "Defines notification templates for prayers and a formatter to customize bodies with time and lead minutes.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from the Aladhan API using coordinates.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes kerahat time windows and merges them with prayer times into a sorted list.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays daily prayer times with offset editing, kerahat windows, and location-based fetching.",
  "frontend/src/features/prayer/timeOffset.ts": "Provides functions to shift prayer times by a minute offset and return updated time strings.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "Fetches prayer times via React Query using location coordinates with caching and retry logic.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "UI component for displaying and interacting with the Qibla finder, handling location selection and device orientation.",
  "frontend/src/features/qibla/qiblaMath.ts": "Implements great‑circle math to compute Qibla bearing and normalize angles.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "Custom hook to read device orientation, request permissions, and produce a compass heading.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Defines static text sections describing fasting basics, rules, and recommendations.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Contains a list of 30 Ramadan menus with daily sahur and iftar items.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "Main Ramadan tab showing prayer times, menus, and educational content with location and offset handling.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing Tarawih prayer details and guidance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook that returns a deterministic daily menu and updates automatically at midnight.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility helpers for local day calculations and Turkish date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri events to Gregorian dates by scanning a full year using Intl API formatting.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Static dataset defining all 2026 Islamic days with fixed Gregorian dates and Turkish labels.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "Type definitions for Hijri events and computed Gregorian religious day objects.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "React UI tab showing 2026 Islamic days, highlighting the next upcoming event and listing all days with status badges.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "Hook returning the 2026 religious days, determining the next upcoming event and days remaining.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty placeholder component file for the Friday sermon tab.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty placeholder hook for fetching the latest sermon.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only form for updating latest app release version and Play Store URL with validation and success/error UI.",
  "frontend/src/features/settings/appSettingsModel.ts": "Type definitions for app settings including location, notifications, fasting, and adhkar tracking.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Local storage manager for settings with versioned migration logic and default notification/prayer settings.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI for adjusting time offset and per-prayer notification lead times, plus admin release section.",
  "frontend/src/features/settings/useAppSettings.ts": "Manages loading and saving app settings using React Query with local storage fallback.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Provides static tasbihat definitions including Arabic, transliteration, translation, and repetition counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "Renders a scrollable list of tasbihat items with Arabic text, translation, and counts.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Shows a compact weather snippet based on stored location using useWeather.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather from Open-Meteo and maps weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "Custom React Query hook to fetch weather data for a given location.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays detailed weather info or prompts for location selection, using Open-Meteo data.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital tasbih counter with target setting and persistent storage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables and global styles for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/nativeNotifications.ts": "Provides helpers to send native Android notifications via a WebView bridge, with fallbacks and support checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container settings, and plugin usage.",
  "project_state.json": "Project metadata describing the Ramadan fasting checklist features, state versioning, and pending requests."
}