{
  "backend/main.mo": "Manages per-caller app settings with access control, allowing users to read or update their own settings and admins to view others' settings.",
  "feature_evidence.json": "Defines feature evidence entries linking Namaz Öğretici refactor requirements to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Lists short summaries of many frontend files, describing their purpose and functionality within the app.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and global background/foreground rules.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, favicon, and mounting the React app root.",
  "frontend/src/App.tsx": "Main React component rendering header and tabbed navigation for all app sections.",
  "frontend/src/components/AuthButton.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/MobileTabsNav.tsx": "Responsive tab navigation component providing five primary app tabs with icons.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card UI prompting the user to choose a location with a button callback.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Renders a styled card for an Esmaül Hüsna item with rotating color themes and tap interaction.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of Allah’s names with Arabic text, transliteration, Turkish meaning, and related prayers.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a grid of Esmaül Hüsna cards and shows item details in a dialog when selected.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Calculates the current prayer slot by comparing the current time to adjusted prayer times.",
  "frontend/src/features/home/HomeTab.tsx": "Main home tab component that shows location selection, weather summary, next prayer countdown, and prayer time cards depending on user settings.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Displays the upcoming prayer and remaining time using computed countdown data, handling loading and error states.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders four clickable content cards (verse, hadith, dua, esma) for the current prayer slot with a dialog for detailed text.",
  "frontend/src/features/home/time-content/duasData.ts": "Exports a list of dua items containing Arabic text, Turkish translation, and usage occasions.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Exports a list of hadith items with Arabic text, Turkish translation, and source references.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports an array of Quran verses with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that determines and updates the current prayer time slot by recalculating every minute.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that finds the next prayer time and computes the remaining time until it, updating every minute.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content based on the current prayer slot.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching, selecting, and saving a geographic location using geocoding results.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Handles location search via Open-Meteo API and converts geocoding results into internal Location objects.",
  "frontend/src/features/location/types.ts": "Defines Location and GeocodingResult types used for geocoding and location handling.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that fetches geocoding results based on user search text.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Renders the prayer tutorial section with rakat info and gender-specific step-by-step prayer instructions.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Provides rakat counts and detailed step sequences for men’s and women’s prayer tutorials.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from the Aladhan API and maps them into a simplified structure.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays prayer times for the selected location with optional minute offsets and allows editing the offset setting.",
  "frontend/src/features/prayer/timeOffset.ts": "Provides functions to apply minute offsets to individual times and complete prayer time sets.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that loads prayer times for the given location with caching and retries.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines the shape of application settings including location, offsets, notifications, and zikirmatik data.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Handles loading, migrating, and saving app settings in localStorage with versioning and defaults.",
  "frontend/src/features/settings/SettingsTab.tsx": "Renders settings UI for prayer time offsets and notification lead times, allowing users to save changes.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query–based hook for loading and updating app settings persisted in localStorage.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather data from Open-Meteo and provides a helper to map weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook to fetch and cache weather data for the selected location.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays current weather for the selected location using fetched data and fallback prompts when missing.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital tally counter with persistence, target setting, progress display, and reset functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity, initializing access control and refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity login, stored identities, status flags, and AuthClient configuration.",
  "frontend/src/index.css": "Defines Tailwind layers, global CSS variables, and light/dark theme colors with additional utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-stored parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing app requirements, architecture notes, existing features, and future functional specifications."
}