{
  "backend/main.mo": "Main actor handling user profiles, app settings, and sermon fetching/caching with access control and HTTP outcalls.",
  "backend/migration.mo": "Defines migration types and a no-op migration function from old sermon cache state to new actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files covering styling, API hooks, settings, prayer times, weather, and components.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry with metadata, Inter font links, app icon, and React root mount.",
  "frontend/src/App.tsx": "Main app component rendering header and mobile tab navigation with all feature tabs.",
  "frontend/src/components/AuthButton.tsx": "Empty placeholder file for authentication button component.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile tab navigation component using shadcn Tabs with six app sections.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card prompting users to select a location with icon and navigation callback.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Stylized card component displaying an Esmaül Hüsna item with rotating color themes.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Exports the Esmaül Hüsna item interface and a dataset containing the names, meanings, and prayers.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Renders a grid of Esmaül Hüsna cards and shows detailed info in a dialog when a card is selected.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Provides logic to determine the current prayer slot based on adjusted prayer times.",
  "frontend/src/features/home/HomeTab.tsx": "Displays location, weather, next prayer countdown, and prayer times, with a dialog for location setup.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Shows the upcoming prayer name, time, and remaining duration using countdown hook logic.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders clickable cards for verse, hadith, dua, and esma content and displays full content in a dialog.",
  "frontend/src/features/home/time-content/duasData.ts": "Defines a dua item interface and exports a list of Arabic duas with Turkish meanings and occasions.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Defines the HadithItem interface and exports a static list of hadiths with Arabic text, Turkish translation, and sources.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines the VerseItem interface and provides a static array of Quran verses with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "A React hook that determines and tracks the current prayer slot, updating once per minute.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "A React hook that computes the next prayer time and remaining time until it, updating every minute.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content based on the current prayer slot.",
  "frontend/src/features/location/LocationSetupSection.tsx": "Component allowing users to search for and select a location, displaying current selection and geocoding results.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Functions to query the Open-Meteo geocoding API and convert results into internal Location objects.",
  "frontend/src/features/location/types.ts": "Type definitions for Location and GeocodingResult objects.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that performs debounced geocoding searches through the Open-Meteo API.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "UI for a namaz tutorial tab showing rakat counts and step-by-step prayer instructions for men and women.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Defines interfaces and data for namaz steps and rakat counts, including detailed step-by-step instructions for men and women.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches prayer times from the Aladhan API and maps the response into a normalized PrayerTimes object.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "React component that displays daily prayer times, applies user‑defined offsets, and allows editing of offset settings.",
  "frontend/src/features/prayer/timeOffset.ts": "Provides functions to apply minute offsets to individual times or full prayer time objects.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that loads prayer times based on the selected location with caching and retry logic.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "UI component that displays the latest Friday sermon with loading, error, empty, and refresh states.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Hook that retrieves and refreshes the latest sermon via an actor using React Query and mutation.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines the AppSettingsModel interface for persisted app settings, including location and notifications.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Handles loading, migrating, and saving settings in localStorage with versioning and defaults.",
  "frontend/src/features/settings/SettingsTab.tsx": "Renders settings for time offsets and notification lead times with inputs and save actions.",
  "frontend/src/features/settings/useAppSettings.ts": "Manages app settings with React Query, loading from and saving to local storage with defaults.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather from Open-Meteo and maps weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook that retrieves weather data for a given location with retries and caching.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays weather info for the selected location, handling loading, errors, and UI layout.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital counter UI with progress, target settings, and persistence via app settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables including light/dark color palettes.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL or session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state for rebuilding the Cuma Hutbesi feature, including requirements, issues, and new feature requests for automated sermon fetching and parsing."
}