{
  "backend/main.mo": "Actor provides app settings storage with access control plus fetching, parsing, caching, and returning the latest sermon via HTTP outcalls.",
  "backend/migration.mo": "Migration adds a new latestSermonCache field while preserving existing appSettings.",
  "feature_evidence.json": "Feature evidence report listing two sermon-related frontend features, their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files covering styling, settings, location search, APIs, tabs, and feature sections.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point with metadata, Inter font loading, and root div for the app.",
  "frontend/src/App.tsx": "Main app component rendering header and mobile tab navigation with six feature tabs.",
  "frontend/src/components/AuthButton.tsx": "Empty file placeholder for authentication button component.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile-oriented tab navigation component defining six tabs and rendering their content.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Prompt card shown when no location is selected, guiding the user to location setup.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Card component displaying an Esmaül Hüsna item with rotating warm color themes and tap interaction.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the Esmaül Hüsna item interface and provides a dataset of names with meanings and prayers.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a grid of Esmaül Hüsna cards and shows detailed info in a dialog when a card is selected.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Provides logic to determine the current prayer slot based on adjusted prayer times.",
  "frontend/src/features/home/HomeTab.tsx": "Shows location, weather, next prayer countdown, and prayer time cards, with a dialog for selecting location.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Calculates and displays the next prayer time and its remaining countdown.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders four content cards for the current prayer slot and opens a dialog with full content when tapped.",
  "frontend/src/features/home/time-content/duasData.ts": "Defines a dua item interface and exports a list of duas with Arabic text, Turkish meaning, and occasions.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Defines a HadithItem interface and exports a static array of hadith entries with Arabic text, Turkish translation, and sources.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports a static array of Quran verse entries with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that determines and tracks the current prayer slot, updating every minute using getCurrentPrayerSlot.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that calculates the next prayer time and remaining time until it, updating once per minute.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content based on the current prayer slot using seeded selection.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching, selecting, and saving a user location using geocoding results and app settings.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Fetches geocoding results from Open-Meteo and converts results into internal Location objects.",
  "frontend/src/features/location/types.ts": "Defines TypeScript types for Location and GeocodingResult used in the location features.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that performs debounced geocoding searches against the Open-Meteo API.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Renders the Namaz teaching tab with rakat info and gender-specific step-by-step prayer instructions.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Defines interfaces and static content for namaz steps and prayer rakats, including detailed step-by-step instructions for men and placeholders for women.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches prayer times from the Aladhan API and normalizes the response into a simplified PrayerTimes structure.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "React component that displays prayer times, handles location prompts, applies time offsets, and manages offset editing state.",
  "frontend/src/features/prayer/timeOffset.ts": "Provides functions to apply minute offsets to time strings and prayer time objects.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that retrieves prayer times using location data and handles caching and retries.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "UI component for displaying the latest sermon with loading, error, empty states, and manual refresh support.",
  "frontend/src/features/sermon/useLatestSermon.ts": "React Query hook that loads and refreshes the latest sermon using an actor backend client.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines the shape of application settings, including location, offsets, notifications, and zikirmatik values.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Handles loading, migrating, and saving settings to localStorage with versioned schema management.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI allowing users to change time offset and prayer notification lead times.",
  "frontend/src/features/settings/useAppSettings.ts": "Manages app settings via React Query, loading from and saving to local storage with defaults.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather data from Open-Meteo and maps weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook that fetches weather data based on the user's selected location.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays weather info for the selected location, showing loading and error states.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital counter with target setting, progress tracking, and persistent storage.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm color theme with light/dark variants.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and includes typography, container‑queries, and animate plugins.",
  "project_state.json": "Defines the project's current state, features, architectural notes, and known issues for a mobile-first Islamic app with prayer times, geocoding, Esmaül Hüsna, Zikirmatik, and hutbe fetching."
}