{
  "backend/main.mo": "Main Motoko actor providing user profile and app settings storage, sermon caching, app release management, and prayer times fetching via HTTP outcalls to Aladhan API with access control authorization.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: manual location selection with persistence, immediate prayer time display after location selection, prayer times display on home tab, and Ramadan-specific times display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including global styles with OKLCH colors and Islamic patterns, location/geocoding services, app settings with multi-layer storage, prayer times and weather fetching hooks, and UI components for location setup and prayer display.",
  "frontend/docs/android-webview-template.md": "Complete Android Studio template guide for wrapping the web app in a native Android WebView with JavaScript bridge for notifications, AlarmManager integration, offline caching, and Play Store version checking.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point loading Inter font from Google Fonts, setting Turkish locale, including favicon and android-widget-bridge.js script before the main React app bundle.",
  "frontend/public/android-widget-bridge.js": "Standalone JavaScript bridge providing global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface for updating Android WebView widgets via SharedPreferences with input validation and error handling.",
  "frontend/src/androidPushBridge.d.ts": "TypeScript declarations for window.AndroidPush interface that sends expanded prayer-times JSON data (including dailyPrayers and weeklyPrayers arrays with timeMillis) to native Android for SharedPreferences storage, alarm scheduling, and widget updates.",
  "frontend/src/androidWidgetBridge.d.ts": "TypeScript declarations for Android widget bridge global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface that send prayer data to native Android widgets using HH:MM time strings.",
  "frontend/src/App.tsx": "Main React app component that sets up QueryClient, manages tab navigation, renders header with weather summary, and conditionally renders feature tabs (prayer times, Quran, zikirmatik, etc.) based on selected tab state.",
  "frontend/src/components/AuthButton.tsx": "Empty React component that returns null, likely a placeholder for future authentication functionality.",
  "frontend/src/components/HeaderFlourish.tsx": "React component that renders a decorative Islamic divider flourish image centered in the header, hidden on mobile and semi-transparent on larger screens.",
  "frontend/src/components/MobileTabsNav.tsx": "React component that renders a bottom tab navigation bar with 4 primary tabs (Home, Esma端l H端sna, Zikirmatik, Ramazan) and an overflow menu for additional features, using Tabs UI component with Islamic pattern background.",
  "frontend/src/components/SelectLocationPrompt.tsx": "React component that displays a card prompting users to select a location before viewing prayer times and weather, with a button to navigate to location settings.",
  "frontend/src/components/TabsOverflowMenu.tsx": "React dropdown menu component that displays 12 overflow tab items (Quran reading, prayer tracker, fasting tracker, nearby mosques, etc.) with icons, allowing users to navigate to additional features not shown in the main tab bar.",
  "frontend/src/features/adhkar/adhkarData.ts": "Defines TypeScript interfaces and static data arrays for morning and evening adhkar (Islamic remembrances), including Arabic text, transliterations, translations in Turkish, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "React component that displays morning and evening adhkar (Islamic remembrances) with checkboxes to track completion, showing Arabic text, transliteration, and translation for each item, with reset functionality stored in app settings.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports a constant string representing the current app version (\"1.0.0\") using semantic versioning, intended to be manually updated before each release.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides utility functions to compare semantic version strings (e.g., \"1.2.3\") and determine if one version is newer than another, with fallback to string comparison on parse errors.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "React component that displays a dismissible alert prompting users to update the app when a newer version is available on the Play Store, using local storage to remember dismissals per version.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Local storage utilities for persisting and retrieving the dismissed app update version, allowing the update prompt to reappear only when a new version is released.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks if the current user is an admin by calling the backend actor's isCallerAdmin method, returning false by default on errors.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata from the backend, returning null gracefully if unavailable or on error.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation hook for updating the latest app release metadata in the backend (admin-only), invalidating the release query on success.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Defines TypeScript interfaces and static data for dua categories (travel, healing, abundance, etc.) and their associated prayers with Arabic text, transliterations, and Turkish translations.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "React component that displays a categorized dua (prayer) guide with tabs for different occasions, a scrollable list of duas, and a dialog showing full Arabic text, transliteration, and translation.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "React component that renders a single Esma-ul Husna (99 Names of Allah) card with Arabic name, transliteration, and a numbered badge, using rotating gradient colors and hover effects.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the data structure and array containing all 99 names of Allah with their Arabic text, transliteration, Turkish meanings, and associated prayers. Content is truncated but shows the first 17 entries.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a grid of Allah's 99 names (Esma端l H端sna) with clickable cards that open a dialog showing detailed information including Arabic text, transliteration, Turkish meaning, and associated prayer (dua).",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Manages fasting tracking including voluntary fasts, make-up fasts with target counts, and Ramadan day-by-day status tracking. Provides UI for adding/removing dates and updating targets with validation.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays a 30-day Ramadan fasting checklist with progress tracking, allowing users to mark each day as 'Fasted' or 'Missed' with a reset confirmation dialog.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Tracks Quran reading progress (Hatim) by page number (1-604) with increment/decrement buttons, manual input, progress bar, and reset functionality, persisting state to app settings.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Determines the current prayer slot (fajr, sunrise, dhuhr, asr, maghrib, isha) by comparing current time against adjusted prayer times.",
  "frontend/src/features/home/formatRemainingTime.ts": "Formats remaining milliseconds into zero-padded countdown strings: mm:ss for under 1 hour, HH:mm:ss for 1 hour or more, clamping negatives to zero.",
  "frontend/src/features/home/HomeTab.tsx": "Main home screen displaying prayer times, weather, location selector, next prayer countdown, and weekly prayer schedule. Handles default location fallback, time offsets, and Android widget updates.",
  "frontend/src/features/home/MotifButton.tsx": "A button component that wraps the base Button with a subtle Islamic pattern tile overlay background for decorative purposes.",
  "frontend/src/features/home/MotifFrame.tsx": "A decorative frame component with three variants: default (no decoration), ornamental (corner ornaments at all four corners), and divider (content with a bottom flourish separator).",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Presentational component displaying the next prayer name, time, and countdown in mm:ss or HH:mm:ss format, receiving computed data from parent to avoid duplicate bridge calls.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays four clickable cards (verse, hadith, dua, esma) for the current prayer slot with icons and gradients, opening a dialog with full Arabic/Turkish content when clicked.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Displays a three-column strip showing sahur time, iftar time, and a countdown to the next relevant event (sahur or iftar) during Ramadan.",
  "frontend/src/features/home/time-content/duasData.ts": "Exports an array of 20+ dua items with Arabic text, Turkish translation, and occasion labels for display in prayer time cards.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Defines HadithItem interface and exports an array of 30+ hadiths with Arabic text, Turkish translations, and source references (Buhari, Muslim, etc.).",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem interface and exports an array of Quranic verses with Arabic text, Turkish translations, and Surah references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that sends comprehensive prayer time data (next prayer, daily/weekly schedules with millisecond timestamps) to AndroidPush interface, deduplicating updates by comparing JSON payloads.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily and weekly prayer times to Android widgets via legacy and new bridge interfaces, deduplicating updates by tracking last-sent payloads.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks the current prayer time slot (fajr, sunrise, dhuhr, etc.) and updates every minute when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that computes the next prayer with live per-second countdown, exposes millisecond timestamp and formatted time remaining, and sends updates to Android bridge only when next prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "React hook that selects random verse, hadith, dua, and Esmaul Husna content for display cards, using the current prayer slot as a seed for stable randomization within each slot.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "Custom React hook that calculates and returns countdown information for the next sahur (pre-dawn meal) or iftar (breaking fast) time based on adjusted Fajr and Maghrib prayer times, updating every minute.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Renders a weekly prayer times table with sticky first column, highlighting today's row, and showing all six daily prayer times (Imsak, Sunrise, Dhuhr, Asr, Maghrib, Isha).",
  "frontend/src/features/location/LocationSetupSection.tsx": "React component providing a location search interface using geocoding, allowing users to search and select a location which is then saved to multiple storage mechanisms and triggers prayer time query invalidation.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Provides functions to search locations using the Open-Meteo Geocoding API and convert geocoding results to the app's Location type format.",
  "frontend/src/features/location/types.ts": "Defines TypeScript interfaces for Location and GeocodingResult, and exports a DEFAULT_LOCATION constant set to Istanbul, Turkey.",
  "frontend/src/features/location/useGeocodingSearch.ts": "Custom React Query hook that fetches geocoding search results from Open-Meteo API, enabled only when search text is at least 2 characters long.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "React component displaying a prayer tutorial tab with rakat counts for daily prayers and step-by-step prayer instructions with gender-specific flows (men/women) according to Hanafi tradition in Turkey.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Contains static content data for prayer tutorials including rakat counts for five daily prayers and detailed step-by-step instructions with Arabic text for both men and women following Hanafi tradition.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions for calculating great-circle distance between coordinates using Haversine formula and formatting distances in meters or kilometers.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "React component providing location search functionality specifically for nearby mosque features, allowing users to search, select, and either temporarily use or save a location as default.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "API client that queries OpenStreetMap's Overpass API to fetch nearby mosques (Muslim places of worship), calculates distances, and returns sorted results.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "React component that displays a location search interface and lists nearby mosques within 5km radius, with options to save location and open mosques in Google Maps.",
  "frontend/src/features/nearbymosque/types.ts": "TypeScript interface definition for NearbyMosque with id, name, coordinates, distance, and optional address.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques based on latitude, longitude, and radius, with 5-minute cache and conditional enabling.",
  "frontend/src/features/notifications/notificationCopy.ts": "Centralized notification text templates for prayer times (Fajr, Dhuhr, Asr, Maghrib, Isha, Sunrise) with formatting utilities for time and lead minutes.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "React component for tracking daily prayer completion with checkboxes and managing kaza (missed prayer) counters with increment/decrement controls.",
  "frontend/src/features/prayer/aladhanApi.ts": "API client that fetches daily prayer times from Aladhan API via backend proxy using method 13, returning formatted prayer times object.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "API client that fetches 7 days of prayer times from Aladhan API via backend proxy, returning array of daily prayer times with Turkish day labels.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes three Islamic kerahat (forbidden prayer) time windows based on sunrise, dhuhr, and maghrib times, and merges them with prayer times into a chronologically sorted list.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "React component that displays daily prayer times with icons, applies time offsets, and shows kerahat (forbidden prayer) windows with visual warnings.",
  "frontend/src/features/prayer/timeOffset.ts": "Provides utility functions to apply minute offsets to prayer times with 24-hour wraparound, supporting single times, daily prayer sets, and weekly prayer schedules.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that fetches daily prayer times from the Aladhan API using location coordinates and actor, with 30-minute cache and retry logic.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook that fetches weekly prayer times from the Aladhan API using location coordinates and actor, with 30-minute cache.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays a Qibla compass using device orientation and location, showing direction to Kaaba with visual compass and handling location setup and permissions.",
  "frontend/src/features/qibla/qiblaMath.ts": "Calculates the great-circle bearing from any geographic coordinate to the Kaaba in Mecca using spherical trigonometry.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that accesses device compass heading via DeviceOrientationEvent API, handling iOS 13+ permission requests and cross-platform compatibility.",
  "frontend/src/features/quran-reading/quranApi.ts": "Frontend API client for Al-Quran Cloud that fetches surah metadata, Arabic text, Turkish translations, and audio recitation URLs with in-memory caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "React component providing a Quran reader interface with surah list, Arabic text with Turkish translation toggle, audio playback controls, and persistent reading position state.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "Custom React hook that manages audio playback for Quran ayahs with controls for play/pause, navigation between ayahs, seeking, and auto-play next functionality using HTML5 Audio API.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "Hook that manages and persists Quran reading state (last surah/ayah numbers and scroll position) using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content data defining fasting basics sections including what fasting is, who must fast, how to fast, what breaks the fast, and recommended/prohibited behaviors during fasting.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Data file containing 30 days of Ramadan menu suggestions with sahur and iftar meal plans for each day.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "React component displaying Ramadan corner with prayer times (imsak/iftar), location setup dialog, fasting basics, taravih information, and daily rotating menu suggestions.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content data describing taravih prayer details including number of rakats, how to perform it, and notes about Ramadan observance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook that returns the current day's Ramadan menu by rotating through 30 menus based on day of year, automatically updating at midnight.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for local timezone date operations including start of day calculation, days between dates computation, and Turkish locale date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri calendar events to Gregorian dates for a given year by scanning each day and using the browser's Intl API with Islamic calendar support.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Contains a hardcoded dataset of 15 Islamic religious days for 2026 with Turkish names, Gregorian dates, and corresponding Hijri month/day values.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "Defines TypeScript interfaces for Hijri events (with month/day) and computed religious days (with Gregorian date and display formatting).",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "Component displaying 2026 Islamic religious days in Turkish with highlighted next upcoming event and countdown, showing full yearly list with past/future indicators.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook that returns the fixed 2026 religious days list, identifies the next upcoming event, and calculates days remaining until it.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file for the Friday sermon tab component.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file for a hook to fetch the latest sermon.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only React component for managing app release metadata (version and Play Store URL) with form inputs, validation, and success/error messaging.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines TypeScript types for app settings including location, prayer times, notifications, fasting tracking, Quran progress, and prayer checklists.",
  "frontend/src/features/settings/durableLocationStorage.ts": "Provides multi-layer location persistence using IndexedDB as primary storage with localStorage and sessionStorage as fallback backups, including validation and recovery logic.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Manages local storage of app settings including location, prayer times, notifications, and various feature states with versioning, migration, and multi-layer location recovery.",
  "frontend/src/features/settings/SettingsTab.tsx": "React component providing UI for general app settings including prayer time offset adjustment and per-prayer notification lead time configuration.",
  "frontend/src/features/settings/useAppSettings.ts": "React hook that manages app settings using TanStack Query, providing methods to load/save settings from local storage with default values for prayer times, notifications, Quran progress, fasting, and other Islamic app features.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Data file defining the structure and content of five post-prayer tasbihat items including Subhanallah, Alhamdulillah, Allahu Akbar, Kelime-i Tevhid, and Ayetel Kursi with Arabic, transliteration, and translations.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "React component displaying post-prayer tasbihat (dhikr phrases) in a scrollable card layout with Arabic text, transliteration, translation, and repetition counts.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Compact weather display component showing temperature and weather description with a cloud icon, conditionally rendered based on location settings.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "API client for fetching weather data from Open-Meteo service and utility function to convert weather codes to Turkish descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook for fetching and caching weather data based on location coordinates with 10-minute stale time.",
  "frontend/src/features/weather/WeatherSection.tsx": "Card-based weather section component displaying current temperature, weather description, wind speed, and humidity using the Open-Meteo API data.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Digital tasbih (dhikr counter) component with increment/reset buttons, customizable target, progress bar, and persistent state management through app settings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including color palettes (emerald primary, amber secondary, turquoise accent), prayer-specific colors for six prayer times, and responsive typography utilities for headings, body text, and Arabic text.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/androidBridge.ts": "Provides safe TypeScript wrappers for calling Android WebView bridge methods to send prayer time data (next prayer, daily prayers, weekly prayers) to native Android layer for widget updates, with graceful fallback when bridge is unavailable.",
  "frontend/src/utils/nativeNotifications.ts": "Utility for triggering native Android notifications via WebView JavaScript bridge, including prayer-specific and generic notifications, with support for checking bridge availability and retrieving app version.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining container settings, custom color system using OKLCH color space with CSS variables, border radius tokens, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking the prayer times application state, documenting that the Aladhan API-based prayer times feature with manual location selection is broken and needs restoration across homepage and Ramadan tab displays."
}