{
  "backend/main.mo": "Manages per-caller app settings with access control checks for viewing and saving settings.",
  "feature_evidence.json": "Feature evidence listing features, linked files, components, and test IDs for Namaz Öğretici updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files covering styling, data fetching, settings, and UI components.",
  "frontend/index.css": "Defines Tailwind base layers and a full OKLCH color variable scheme for light and dark themes.",
  "frontend/index.html": "HTML entry point setting up metadata, Inter font, and mounting the React app.",
  "frontend/src/App.tsx": "Main app layout with header and five-tab mobile navigation including Namaz Öğretici.",
  "frontend/src/components/AuthButton.tsx": "Empty file placeholder for the authentication button component.",
  "frontend/src/components/MobileTabsNav.tsx": "Responsive five-tab navigation component using shadcn Tabs with icons.",
  "frontend/src/components/SelectLocationPrompt.tsx": "UI card prompting the user to pick a location with a button callback.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Displays an Esmaül Hüsna item in a colored card with Arabic name, transliteration, and tap hint.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and provides an array of Esmaül Hüsna names with Arabic text, transliteration, Turkish meaning, and related duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Renders grid of Esmaül Hüsna cards and a dialog showing selected item details and dua.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Provides logic to determine the current prayer time slot from adjusted prayer times by comparing minutes.",
  "frontend/src/features/home/HomeTab.tsx": "Main home tab UI that shows location selection, weather data, next prayer countdown, and prayer time cards with adjusted prayer times.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Displays the next prayer name, its time, and remaining countdown using computed next prayer data.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders interactive cards for verse, hadith, dua, and Esma content based on the current prayer slot and opens detailed dialogs.",
  "frontend/src/features/home/time-content/duasData.ts": "Contains a list of dua items with Arabic text, Turkish meaning, and occasions for contextual usage.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Contains a list of hadith entries with Arabic text, Turkish translation, and source references.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines a VerseItem interface and exports an array of Quran verse objects with Arabic text, Turkish translation, and references.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that determines and updates the current prayer slot every minute using adjusted prayer times.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that finds the next prayer time and computes a live countdown updated every minute.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content based on the current prayer slot.",
  "frontend/src/features/location/LocationSetupSection.tsx": "UI component for searching, selecting, and saving a user location using geocoding results.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Provides a function to search locations via Open-Meteo API and convert results into internal Location objects.",
  "frontend/src/features/location/types.ts": "Defines TypeScript types for Location and GeocodingResult objects.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that performs debounced geocoding searches when input text has at least two characters.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Interactive tutorial component for prayer steps with gender selection, swipe navigation, and rakat info.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Exports prayer rakat counts and step-by-step instructional content for men’s and women’s prayer flows.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches today's prayer times from the Aladhan API and maps the response to a normalized structure.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays adjusted prayer times based on user location and offset settings, with UI for offset editing.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to individual prayer times and returns adjusted prayer time objects.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that loads prayer times for a given location via the Aladhan API.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines the shape of application settings including location, offsets, notifications, and zikirmatik values.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Handles loading, migration, and saving of app settings in localStorage with versioned schema support.",
  "frontend/src/features/settings/SettingsTab.tsx": "Provides UI for editing the global time offset and individual prayer notification lead times.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query wrapper for reading and updating persistent app settings through local storage.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather data from Open-Meteo and provides a utility to map weather codes to descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook that retrieves current weather data for a given location.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays weather information for the user’s location, including temperature, conditions, wind, and humidity.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital counter with target tracking, progress display, and persistence via app settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity login flow, storing identities, and exposing login/clear/status helpers.",
  "frontend/src/index.css": "Defines Tailwind base layers and a warm color palette with light/dark modes and a background pattern utility.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, animations, and container settings with plugins for typography, container queries, and animation.",
  "project_state.json": "Describes the current app plan and requirements, including prayer times logic, Esmaül Hüsna, Zikirmatik features, and image needs."
}