{
  "backend/main.mo": "Main Motoko actor implementing user profiles, app settings, sermon caching, prayer times proxy (Aladhan API with Turkey method), app release management, and admin-controlled translation/cache keys with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing prayer times display errors on home and Ramadan tabs, and implementing persistent city selection using localStorage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files covering styling (OKLCH colors, Islamic patterns, responsive typography), location services (geocoding, localStorage persistence), prayer times (Aladhan API integration, offset utilities), weather, and UI components.",
  "frontend/docs/android-webview-template.md": "Complete Android Studio WebView wrapper template guide for packaging the web app as native Android APK/AAB with JavaScript bridge for notifications, prayer times, offline caching, and Play Store integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point loading Inter font, app icon, and android-widget-bridge.js script before the main React bundle for WebView integration.",
  "frontend/public/android-widget-bridge.js": "Standalone JavaScript bridge providing global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface for updating Android widgets via WebView SharedPreferences.",
  "frontend/src/androidPushBridge.d.ts": "TypeScript declarations for the AndroidPush WebView interface that sends expanded prayer-times data (next prayer, daily/weekly arrays with timestamps) to native Android for SharedPreferences storage, alarm scheduling, and widget updates.",
  "frontend/src/androidWidgetBridge.d.ts": "TypeScript declarations for Android Widget Bridge global functions that update native Android widgets with prayer times using HH:MM format strings and timestamps for next prayer, daily prayers, weekly prayers, and city name.",
  "frontend/src/App.tsx": "Root React component with QueryClient provider, tab navigation state, default location fallback logic, sticky header with logo and weather summary, and tab content rendering for all app features including Toaster for notifications.",
  "frontend/src/components/AuthButton.tsx": "Empty React component that returns null, likely a placeholder for future authentication functionality.",
  "frontend/src/components/HeaderFlourish.tsx": "React component that displays a decorative Islamic divider flourish image centered in the header, hidden on mobile and semi-transparent.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile navigation component using tabs with icons for Home, Esmaül Hüsna, Zikirmatik, Ramazan, and an overflow menu for additional features, with Islamic pattern background on the tab bar.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card component prompting users to select a location before viewing prayer times and weather, with a button to navigate to location selection.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Dropdown menu component displaying overflow navigation items (Quran Reading, Prayer Tracker, Fasting Tracker, Nearby Mosques, etc.) with icons and ornamental accent decoration.",
  "frontend/src/features/adhkar/adhkarData.ts": "Data file defining morning and evening adhkar items with Arabic text, transliteration, Turkish translation, and repetition counts for prayers like Ayetel Kürsi, İhlas, Felak, and Nas surahs.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "React component for morning and evening adhkar (remembrance) lists with checkboxes to track completion, reset buttons, and progress counters, persisting state via app settings.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports the current app version constant (\"1.0.0\") using semantic versioning, intended to be manually updated before each Play Store release.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison functions that parse and compare version strings (e.g., \"1.2.3\") numerically, with fallback to string comparison on parse errors.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Displays a dismissible alert prompting users to update when a newer app version is available from the backend, with a button to open the Play Store URL and per-version dismissal tracking.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Manages localStorage for storing and retrieving the dismissed update version, allowing the update prompt to be hidden per-version.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks if the current user is an admin by calling the backend actor's isCallerAdmin method, returning false by default on errors.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata from the backend, returning null gracefully if unavailable or on error.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation hook for updating app release metadata (admin-only), invalidating the latest release query on success to refresh the UI.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Defines dua data structures and exports categorized collections of Islamic prayers with Arabic text, transliteration, Turkish translation, and occasion descriptions for travel, healing, abundance, anger, sustenance, and general categories.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "Displays a categorized dua (prayer) guide with tabs for different occasions, showing a list of duas that open detailed dialogs with Arabic text, transliteration, and Turkish translation.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Renders a single Esmaul Husna (99 Names of Allah) card with gradient background, displaying the number, Arabic name, and transliteration, with hover effects and click handler.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of 99 names of Allah with Arabic text, transliteration, Turkish meanings, and associated duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a grid of all 99 Names of Allah as cards, opening a detailed dialog on click showing the Arabic name, transliteration, Turkish meaning, and associated dua.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Main fasting tracker component that manages voluntary fasts, make-up fasts, and Ramadan day-by-day tracking with date inputs, target counts, and integration with app settings.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays a 30-day Ramadan fasting checklist with progress bar, status toggles (Fasted/Missed), and a reset dialog for tracking Ramadan fasts.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Quran completion (Hatim) tracker that allows users to track their reading progress through 604 pages with increment/decrement controls, progress bar, and reset functionality.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Exports a function that determines the current prayer slot (fajr, sunrise, dhuhr, asr, maghrib, isha) by comparing current time to adjusted prayer times.",
  "frontend/src/features/home/formatRemainingTime.ts": "Utility function that formats milliseconds into zero-padded countdown strings (mm:ss for <1h, HH:mm:ss for ≥1h), clamping negatives to zero.",
  "frontend/src/features/home/HomeTab.tsx": "Main home screen component that orchestrates prayer times, weather, location setup, countdown timers, and Android widget updates with default location fallback.",
  "frontend/src/features/home/MotifButton.tsx": "Custom button component that wraps the base Button with a subtle Islamic tile pattern overlay for decorative styling.",
  "frontend/src/features/home/MotifFrame.tsx": "Decorative frame component with three variants (default, ornamental with corner decorations, divider with flourish) for adding Islamic visual motifs around content.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Presentational component that displays the next prayer name, time, and countdown (mm:ss or HH:mm:ss format) received from parent to avoid duplicate bridge calls.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays four prayer-time-specific cards (verse, hadith, dua, esma) with click-to-expand dialogs, using current prayer slot to fetch content and ornamental corner decorations.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Shows a three-column strip with sahur time, countdown to next target (sahur or iftar), and iftar time using a custom countdown hook.",
  "frontend/src/features/home/time-content/duasData.ts": "Static array of 20+ dua items with Arabic text, Turkish translation, and occasion labels for prayer-time-specific content.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Static array of 21+ hadith items with Arabic text, Turkish translation, and source references for prayer-time-specific content.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem interface and exports versesData array containing 24+ Quranic verses with Arabic text, Turkish translation, and reference.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that computes and sends expanded prayer-times payload (next prayer, daily/weekly times with millisecond timestamps) to AndroidPush interface, deduplicating updates by comparing JSON payloads.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily and weekly prayer times to Android widgets via legacy and new bridge interfaces, deduplicating updates by tracking last-sent payloads.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks the current prayer slot (fajr/sunrise/dhuhr/asr/maghrib/isha) and updates every minute when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that computes next prayer from adjusted times with live per-second countdown, exposing nextPrayer, nextPrayerMillis, and formatted timeRemaining, and sends updates to Android bridge when prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "React hook that selects random verse, hadith, dua, and esma content for cards using the current prayer slot as a seed for consistent randomization within each slot.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "React hook that computes countdown to next sahur (fajr) or iftar (maghrib) based on current time, updating every minute with target label and time remaining.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Renders a scrollable table of weekly prayer times (7 days × 6 times) with sticky first column, loading/error states, and responsive styling.",
  "frontend/src/features/location/LocationSetupSection.tsx": "React component providing a location search UI with geocoding integration; saves selected location to multiple storage mechanisms (durable, localStorage, settings) and invalidates prayer time queries.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Implements geocoding search using Open-Meteo API; fetches location results by name and converts them to internal Location format.",
  "frontend/src/features/location/types.ts": "Defines Location and GeocodingResult interfaces, plus a DEFAULT_LOCATION constant for Istanbul fallback.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that wraps geocoding search with debouncing (min 2 chars), 5-minute cache, and single retry.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "React component displaying prayer tutorial with gender-specific flows (men/women), rakat counts per prayer, and step-by-step instructions with Arabic text.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Static content defining prayer rakat counts and detailed step-by-step instructions for men and women following Hanafi tradition in Turkey.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions implementing Haversine formula for calculating great-circle distance between coordinates and formatting distance for display (meters/kilometers).",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "React component for searching and selecting a location for nearby mosque queries; supports temporary location override or saving as default.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Fetches nearby mosques from OpenStreetMap's Overpass API using coordinates and radius, filters results by name availability, calculates distances, and returns sorted mosque data with optional address information.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "React component displaying nearby mosques within 5km radius of selected location; integrates location search and shows mosque list with distance and map links.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface with id, name, coordinates, distance in meters, and optional address fields.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques based on latitude, longitude, and radius in kilometers, with 5-minute cache and single retry on failure.",
  "frontend/src/features/notifications/notificationCopy.ts": "Centralized notification templates for generic and prayer-time notifications with support for formatting with time and lead minutes.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "React component for tracking daily prayers and kaza (missed) prayers with checkboxes for daily completion and increment/decrement controls for kaza counters, persisting state via app settings.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from Aladhan API via backend actor proxy using coordinates and timestamp, preferring Imsak over Fajr when available.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "Fetches 7 days of prayer times from Aladhan API via backend actor, formatting each day with Turkish locale labels and preferring Imsak for Fajr.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes three kerahat (forbidden prayer) time windows based on sunrise, dhuhr, and maghrib times, and merges them chronologically with regular prayer times for display.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays prayer times with icons, applies user-defined time offsets, merges kerahat (forbidden prayer) windows into the timeline, and handles loading/error states.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies user-defined minute offsets to individual prayer times and entire prayer time objects, handling 24-hour wraparound.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that fetches prayer times for a given location using the backend actor, with 30-minute cache and 2 retries.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook that fetches weekly prayer times from the Aladhan API for a given location, enabled only when location and actor are available.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays a Qibla finder using device compass, showing direction to Kaaba with location setup dialog and permission handling for device orientation.",
  "frontend/src/features/qibla/qiblaMath.ts": "Utility functions for calculating the bearing from any geographic location to the Kaaba in Mecca using great-circle formulas.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that accesses device orientation API to get compass heading, handling iOS 13+ permission requests and browser compatibility.",
  "frontend/src/features/quran-reading/quranApi.ts": "API client for fetching Quran content from Al-Quran Cloud API, including surah metadata, Arabic text, Turkish translations, and audio recitation URLs with in-memory caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "React component providing a Quran reader interface with surah list, Arabic text, Turkish translation toggle, audio playback, and reading position persistence.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "React hook managing audio playback for Quran ayahs with controls for play/pause, navigation between ayahs, auto-play next, and error handling.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "React hook that persists and retrieves Quran reading state (last surah, ayah, scroll position) using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content defining fasting basics in Turkish, including what fasting is, who must fast, how to fast, what breaks the fast, and recommended/prohibited behaviors during Ramadan.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Static dataset of 30 daily Ramadan menus (sahur and iftar meals) in Turkish, each with specific food items for breakfast and dinner during fasting.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "Main Ramadan tab component displaying prayer times (imsak/iftar), location selector, fasting basics, tarawih info, and a daily rotating menu with responsive UI and dialog-based location setup.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing Tarawih prayer in Turkish, including how many rakats, how to perform it, and notes about Ramadan observance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "React hook that returns the current day's Ramadan menu based on day-of-year modulo cycling through 30 menus, with automatic midnight updates via setTimeout/setInterval.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for local date operations including start-of-day normalization, days-between calculation, and Turkish locale date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri events to Gregorian dates for a given year by scanning each day and using Intl.DateTimeFormat with Islamic calendar to match Hijri month/day pairs.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Hardcoded dataset of 15 Islamic religious days for 2026 with Gregorian dates, Turkish names, and Hijri calendar references (e.g., Ramadan Bayramı, Kurban Bayramı, Kandil nights).",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "TypeScript interfaces defining HijriEvent (Hijri month/day definition) and ComputedReligiousDay (Gregorian date instance with display formatting).",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "Tab component displaying all 2026 Islamic religious days in Turkish with a highlighted next-upcoming event card showing days remaining and a full chronological list.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook that returns fixed 2026 religious days data, calculates the next upcoming event, and computes days remaining until that event using local date math.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file with no content.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file with no content.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only component for managing app release metadata (version and Play Store URL) with form inputs, validation, success/error messaging, and immediate UI updates after submission.",
  "frontend/src/features/settings/appSettingsModel.ts": "TypeScript model definitions for app settings including location, prayer times, notifications, zikirmatik, hatim, adhkar, fasting, Ramadan tracking, prayer checklists, kaza counters, and Quran reading progress.",
  "frontend/src/features/settings/durableLocationStorage.ts": "Multi-layer location persistence using IndexedDB as primary storage with localStorage and sessionStorage as redundant backups, including validation and error handling for durable location data.",
  "frontend/src/features/settings/localSettingsStorage.ts": "LocalStorage-based settings persistence with versioning, migration logic, and multi-layer location recovery strategy using IndexedDB, localStorage, and sessionStorage fallbacks.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI component with cards for general settings (prayer time offset adjustment) and notification settings (per-prayer lead times), using the useAppSettings hook for persistence.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query hook for managing app settings with async load/save operations, default values, infinite cache, and both new and legacy API compatibility.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Defines the TasbihatItem interface and exports an array of Islamic prayer phrases (tasbihat) with Arabic text, transliterations, translations, and recommended counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "UI component displaying post-prayer tasbihat (dhikr phrases) with Arabic text, transliteration, translation, and repetition counts in scrollable card layout.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Renders a compact weather display showing temperature and weather description with a cloud icon, hidden when no location is set.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches weather data from Open-Meteo API and provides a helper function to convert weather codes to Turkish descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook that fetches weather data for a given location with 10-minute cache and automatic refetch on location change.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays a detailed weather card with temperature, weather description, wind speed, and humidity for the user's selected or default location.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Digital tasbih (prayer counter) component with increment, reset, progress tracking, and customizable target count that persists to settings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY AuthClient.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, prayer time colors, responsive typography utilities, and Arabic text styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/androidBridge.ts": "Provides safe helper functions to communicate with Android WebView bridge for sending prayer time data (next prayer, daily prayers, weekly prayers) to native Android layer for widget updates and notifications.",
  "frontend/src/utils/nativeNotifications.ts": "Provides interface for triggering native Android notifications via WebView JavaScript bridge, including prayer-specific and generic notifications, with graceful fallback when bridge is unavailable.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, container settings, typography, animations, and plugins for the prayer times application.",
  "project_state.json": "Project metadata tracking prayer times application features, known issues, architectural notes about Aladhan API integration, localStorage city selection, and pending feature requests for Turkish cities."
}