{
  "backend/main.mo": "Canister managing user profiles, app settings, sermon cache, and latest release with access control checks.",
  "feature_evidence.json": "Feature evidence listing features, impacted files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files including settings, prayer times, weather, and UI utilities.",
  "frontend/docs/android-webview-template.md": "Guide and template for embedding the web app in an Android WebView with JavaScript bridge and notifications.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color systems and applying global background/foreground styles.",
  "frontend/index.html": "Main HTML entry enabling fonts, favicon, Android bridge script, and mounting the React app.",
  "frontend/public/android-widget-bridge.js": "Standalone JS bridge exposing functions to update Android prayer widgets via WebView’s Android interface.",
  "frontend/src/androidPushBridge.d.ts": "Declares the AndroidPush interface for sending expanded prayer time JSON data to the Android WebView wrapper. Includes methods for pushing prayer info used for storage, alarms, notifications, and widgets.",
  "frontend/src/androidWidgetBridge.d.ts": "Defines global Android widget bridge functions and the AndroidPrayer interface for updating next, daily, and weekly prayer displays. Provides TypeScript types for prayer items and widget update methods.",
  "frontend/src/App.tsx": "Root React component rendering tabs, header, background motifs, and global UI such as weather and update prompts.",
  "frontend/src/components/AuthButton.tsx": "Exports a placeholder AuthButton React component that currently renders nothing.",
  "frontend/src/components/HeaderFlourish.tsx": "Renders a decorative centered flourish image for headers, shown only on larger screens.",
  "frontend/src/components/MobileTabsNav.tsx": "Implements a mobile tab navigation bar with icons, an overflow menu, and content slots for various app sections. Uses the Tabs component system to switch between views.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Displays a card prompting the user to select a location, with a button that triggers navigation.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Provides a dropdown menu listing additional tabs with icons, allowing users to switch to less frequently used sections. Manages open state and triggers tab selection callbacks.",
  "frontend/src/features/adhkar/adhkarData.ts": "Defines the AdhkarItem type and exports static morning and evening adhkar lists with Arabic text, translations, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "Renders morning and evening adhkar lists with checkboxes, progress tracking, and reset actions. Integrates user settings to persist completion states.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Defines the current app version string used for update comparisons.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison utilities and a helper to check if a version is newer.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Shows a dismissible alert when a newer backend app version exists and lets users open the store link or dismiss the prompt.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "Handles storing, retrieving, and clearing dismissed update version info in localStorage.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks via actor API whether the current user is an admin.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata from the backend actor.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation for updating the latest app release and invalidating related queries.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Defines dua categories and provides categorized dua datasets with text and metadata.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "UI for browsing dua categories, viewing dua lists, and opening detailed dua dialogs.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Card component that displays a single Esmaül Hüsna item and triggers selection on click.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of Allah’s names with Arabic, transliteration, Turkish meaning, and associated duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a list of Esmaül Hüsna cards and shows detailed info in a dialog when selected.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "React component for tracking voluntary, make-up, and Ramadan fasts with date entry, target management, and settings persistence.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays Ramadan fasting progress with a 30-day grid, status toggling, and a reset dialog.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Provides Quran reading progress tracking with page input, increment/decrement controls, progress bar, and settings sync.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Computes the current prayer slot by comparing the current time to adjusted daily prayer times.",
  "frontend/src/features/home/formatRemainingTime.ts": "Formats remaining milliseconds into mm:ss or HH:mm:ss countdown text.",
  "frontend/src/features/home/HomeTab.tsx": "Home screen combining location selection, prayer times, weather, next prayer countdown, and widget updates.",
  "frontend/src/features/home/MotifButton.tsx": "Button wrapper adding an Islamic tile pattern overlay while preserving button variants and props.",
  "frontend/src/features/home/MotifFrame.tsx": "Layout wrapper adding decorative Islamic frame or divider variants around its children.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Displays the next prayer name, time, and remaining countdown with loading and error handling.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Renders a grid of spiritual content cards with modal details based on the current prayer slot.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Shows sahur and iftar times with a live countdown using adjusted prayer times.",
  "frontend/src/features/home/time-content/duasData.ts": "Provides a list of dua items with Arabic text, Turkish translation, and usage context.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Contains a collection of hadith items with Arabic, Turkish, and source metadata.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem and exports an array of Quran verses with Arabic text, Turkish translations, and references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that builds detailed prayer time payloads and sends them to AndroidPush, deduplicating updates.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that formats and sends daily, weekly, and city updates to Android widgets while avoiding redundant transmissions.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "Tracks the current prayer slot by recalculating every minute and updating only when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "Computes the next prayer and a live countdown, updating every second and sending bridge updates when the next prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "Selects deterministic random verse, hadith, dua, and esma content based on the current prayer slot.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "Calculates countdown to sahur or iftar based on fajr and maghrib times, updating every minute.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Displays a weekly timetable of daily prayer times with loading and error states.",
  "frontend/src/features/location/LocationSetupSection.tsx": "Searches and selects a location using geocoding results, saving it to app settings and displaying current selection.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Wraps Open-Meteo geocoding API search and converts results into internal Location format.",
  "frontend/src/features/location/types.ts": "Defines Location and GeocodingResult interfaces used for geocoding and location storage.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that fetches geocoding results when the search text is long enough.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "Displays namaz tutorial steps and prayer rakat counts with gender-based step selection.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Provides structured text content for prayer rakat info and detailed men/women namaz steps.",
  "frontend/src/features/nearbymosque/distance.ts": "Implements Haversine distance calculation and formatting utilities.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "Allows searching and selecting a temporary or saved location for nearby mosque lookup.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Queries the Overpass API for nearby mosques, extracts names, addresses, distances, and returns a sorted mosque list.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "Shows nearby mosques based on active location and allows changing or saving the search location.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface with id, coordinates, distance, and optional address.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "Provides a React Query hook to fetch nearby mosques based on user location and radius.",
  "frontend/src/features/notifications/notificationCopy.ts": "Contains notification templates for generic and prayer-time alerts with helpers for formatting messages.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "Renders the prayer tracker UI allowing users to mark daily prayers and manage kaza counters using app settings.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches daily prayer times from the Aladhan API and maps them into a simplified PrayerTimes object.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "Fetches seven days of prayer times from Aladhan API and formats each day with a Turkish date label.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes kerahat windows and merges them with prayer times into a chronologically sorted list.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays adjusted prayer times with kerahat windows, handles location and offset settings, and shows related UI.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to individual or grouped prayer times with 24‑hour wraparound handling.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook to load daily prayer times based on the selected location.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook to load weekly prayer times using the user's selected location.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React UI for selecting location and displaying Qibla direction using device orientation and calculated bearings.",
  "frontend/src/features/qibla/qiblaMath.ts": "Utility functions to compute Qibla bearing from coordinates using great‑circle math and angle normalization.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that retrieves device compass heading, handles iOS permission, and tracks support/loading states.",
  "frontend/src/features/quran-reading/quranApi.ts": "Frontend API layer fetching surah metadata, text, translations, and audio from Al-Quran Cloud with caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "Main Qur'an learning tab handling surah list, reader view, audio playback, scrolling, and saved reading state.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "Custom hook managing ayah-by‑ayah audio playback, including loading, errors, autoplay, and navigation.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "Hook storing and restoring last read surah, ayah, and scroll position via app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static dataset providing headings and paragraphs explaining basic Ramadan fasting rules and practices.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Contains a list of 30 daily Ramadan menus with sahur and iftar items.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "UI tab showing Ramadan info, prayer times, location prompt, and daily menus, with sections for fasting and tarawih content.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing tarawih prayer structure, method, and Ramadan notes.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook that returns a deterministic daily-rotating menu using the local date and updates at midnight.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for date math: start-of-day, day differences, and Turkish date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri events to Gregorian dates for a year by scanning days and matching hijri calendar values.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Static dataset of 2026 Islamic dates with fixed Gregorian mappings and Turkish names.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "Type definitions for Hijri events and computed Gregorian religious day entries.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "UI tab listing 2026 religious days, highlighting the next upcoming date and marking past ones.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook returning 2026 religious days, computing the next upcoming day and days remaining using memoized logic.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file placeholder for Friday sermon tab component.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file placeholder for latest sermon hook.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only UI for updating app release version and Play Store URL with validation and success/error handling.",
  "frontend/src/features/settings/appSettingsModel.ts": "Type definitions for global app settings, including location, notifications, fasting, Quran progress, and prayer tracking.",
  "frontend/src/features/settings/durableLocationStorage.ts": "IndexedDB-based storage utilities for persisting and retrieving the user's location with get/set/clear functions.",
  "frontend/src/features/settings/localSettingsStorage.ts": "LocalStorage-backed settings loader with defaults, migration logic, and durable location synchronization.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings screen letting users adjust prayer time offsets and notification lead times, saving via app settings hooks.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query wrapper exposing load/save operations for app settings and merging defaults with stored values.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Static array defining tasbihat items with Arabic text, translations, and repeat counts.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "UI tab listing post-prayer tasbihat items with Arabic text, transliteration, translation, and counts.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Displays a compact weather summary using current location, showing loading state or temperature and description.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Fetches current weather data from Open-Meteo and maps weather codes to human-readable descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook that fetches weather data for a given location with caching and retries.",
  "frontend/src/features/weather/WeatherSection.tsx": "Renders a detailed weather card with temperature, conditions, wind, and humidity, handling loading and errors.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital counter with target setting, progress tracking, and persistent storage via app settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence via context.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode palettes, and utility classes including safe-area helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/androidBridge.ts": "Provides safe wrappers for sending prayer data to Android WebView bridges, with validation and fallbacks.",
  "frontend/src/utils/nativeNotifications.ts": "Wraps Android WebView bridge calls for notifications and app info with safe fallbacks for browsers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and remove them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Stores the project’s state, features, and pending requests in a structured JSON format."
}