{
  "backend/main.mo": "Main Motoko actor implementing user profiles, app settings, sermon caching, and app release management with role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting responsive design implementations across location modals, layouts, typography, buttons, and spacing with high confidence mappings to test requirements.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including global styles, location services, prayer times, weather API integration, settings persistence, and responsive UI components with Tailwind breakpoints.",
  "frontend/docs/android-webview-template.md": "Complete Android Studio template guide for wrapping the web app in a native Android WebView with JavaScript bridge, notifications, AlarmManager integration, and Play Store version checking.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point loading Inter font from Google Fonts, app icon, and android-widget-bridge.js script before the main React application bundle.",
  "frontend/public/android-widget-bridge.js": "Standalone JavaScript bridge providing global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface for Android WebView widget updates via SharedPreferences.",
  "frontend/src/androidPushBridge.d.ts": "TypeScript declarations for AndroidPush interface that bridges WebView to native Android for sending prayer times data (next prayer, daily/weekly schedules with timestamps) to SharedPreferences, alarm scheduler, and widgets.",
  "frontend/src/androidWidgetBridge.d.ts": "TypeScript declarations for Android widget bridge global functions that update native Android widgets with prayer times (next prayer, daily prayers, weekly prayers) using HH:MM time strings and timestamps.",
  "frontend/src/App.tsx": "Main application component that sets up React Query, Internet Identity provider, and manages tab navigation between 16+ feature tabs (home, prayer times, weather, settings, Quran reading, etc.). Loads saved location from localStorage on mount and renders mobile tab navigation with Islamic-themed gradient backgrounds.",
  "frontend/src/components/AuthButton.tsx": "Empty authentication button component that returns null (placeholder or disabled feature).",
  "frontend/src/components/HeaderFlourish.tsx": "Decorative header component that displays an Islamic divider flourish image with responsive sizing and opacity, hidden on mobile screens.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile-optimized tab navigation component with 5 primary tabs (home, Esmaül Hüsna, Zikirmatik, Ramazan, overflow menu) and an overflow menu for 12 additional tabs, featuring Islamic pattern backgrounds and responsive sizing.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card component prompting users to select a location before viewing prayer times and weather, with a navigation button to the location settings.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Dropdown menu component for overflow tabs (Quran reading, prayer tracker, fasting tracker, nearby mosques, religious days, qibla finder, etc.) with icons and Islamic ornamental accents.",
  "frontend/src/features/adhkar/adhkarData.ts": "Defines TypeScript interfaces and data arrays for morning and evening adhkar (Islamic remembrances), including Arabic text, transliterations, translations in Turkish, and repetition counts.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "Tab component for morning and evening adhkar (Islamic remembrances) with checkboxes to track completion, displaying Arabic text, transliteration, and translations with reset functionality using app settings storage.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports a constant string for the current app version (\"1.0.0\") using semantic versioning, intended to be manually updated before each release.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison utilities that parse and compare version strings (e.g., \"1.2.3\") numerically, with fallback to string comparison on parse errors.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "React component that displays a dismissible alert when a newer app version is available, comparing backend version with current version and opening Play Store URL on update.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "LocalStorage utilities for persisting and retrieving the dismissed app update version, preventing repeated prompts for the same version.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks if the current user is an admin by calling the backend actor's isCallerAdmin method, returning false by default on errors.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata from the backend actor, returning null gracefully if unavailable or on error.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation hook for updating app release metadata (admin-only), invalidating the latest release query on success to refresh UI.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Defines TypeScript types and data for dua categories (travel, healing, abundance, etc.) and their associated supplications with Arabic text, transliterations, and Turkish translations.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "React component displaying categorized Islamic duas (supplications) with tabs for categories, a scrollable list, and a dialog showing full Arabic text, transliteration, and Turkish translation.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "React card component displaying one of the 99 Names of Allah with Arabic text, transliteration, numbered badge, gradient background, and click handler for viewing details.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the data structure and array for Esmaül Hüsna items, containing 99 entries with Arabic names, transliterations, Turkish meanings, and prayers (content truncated in source).",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Displays a grid of Allah's 99 names (Esmaül Hüsna) with clickable cards that open a dialog showing detailed information including Arabic text, transliteration, Turkish meaning, and associated prayer.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Manages fasting tracking including voluntary fasts, make-up fasts with target counts, and Ramadan day-by-day status tracking with add/remove functionality and date validation.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Renders a 30-day Ramadan fasting checklist with progress bar, day-by-day status toggles (Fasted/Missed), and a reset dialog to clear all tracking data.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Tracks Quran reading progress (Hatim) with page counter (1-604), increment/decrement buttons, manual page input, progress bar, and reset functionality that persists to app settings.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Utility that determines the current prayer time slot (fajr, sunrise, dhuhr, asr, maghrib, isha) based on adjusted prayer times and current time.",
  "frontend/src/features/home/formatRemainingTime.ts": "Formats milliseconds into zero-padded countdown strings: mm:ss for under 1 hour, HH:mm:ss for 1+ hours, clamping negatives to zero.",
  "frontend/src/features/home/HomeTab.tsx": "Main home screen displaying prayer times, weather, location selector, next prayer countdown, weekly prayer times, and Sahur/Iftar information with offset adjustments and Android widget integration.",
  "frontend/src/features/home/MotifButton.tsx": "A button component that wraps the base Button with a subtle Islamic tile pattern overlay background for decorative purposes.",
  "frontend/src/features/home/MotifFrame.tsx": "A decorative frame component with three variants: default (plain), ornamental (corner decorations), and divider (bottom flourish), using Islamic pattern images.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Presentational component displaying the next prayer name, time, and countdown in mm:ss or HH:mm:ss format, receiving computed data from parent to avoid duplicate bridge calls.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays four prayer-time-specific cards (verse, hadith, dua, esma) with icons and gradients, opening a dialog with full content when clicked, using current prayer slot to determine content.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "A horizontal strip showing sahur (fajr) and iftar (maghrib) times with a countdown to the next event, designed for Ramadan fasting schedule display.",
  "frontend/src/features/home/time-content/duasData.ts": "Static data array of 20+ Islamic duas with Arabic text, Turkish translation, and occasion labels for display in prayer time cards.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Defines HadithItem interface and exports an array of 30+ hadiths with Arabic text, Turkish translation, and source references (Buhari, Müslim, etc.).",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem interface and exports an array of 24+ Quranic verses with Arabic text, Turkish translation, and Surah:Ayah references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that sends comprehensive prayer time data (next prayer, daily/weekly schedules with timestamps) to AndroidPush interface, deduplicating updates by comparing JSON payloads.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily and weekly prayer times to Android widgets via both legacy and new bridge interfaces, deduplicating updates to prevent unnecessary calls.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks the current prayer time slot (fajr, sunrise, dhuhr, asr, maghrib, isha) and updates every minute when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that computes the next prayer with live per-second countdown, exposes nextPrayerMillis and formatted timeRemaining, and sends updates to Android bridge only when prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "React hook that selects random verse, hadith, dua, and Esma-ul Husna content for display cards, using the current prayer slot as a seed for stable randomization within each slot.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "React hook that calculates and returns countdown information for sahur (fajr) and iftar (maghrib) times, updating every minute to show time remaining until the next prayer event.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Displays a weekly prayer times table with sticky first column, highlighting today's row, showing all six prayer times (imsak, sunrise, dhuhr, asr, maghrib, isha) for seven days.",
  "frontend/src/features/location/LocationSetupSection.tsx": "React component providing a location search interface using geocoding, allowing users to search for and save locations with persistence to both localStorage and app settings.",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Utility module that fetches location data from Open-Meteo Geocoding API and transforms geocoding results into Location objects with formatted display names.",
  "frontend/src/features/location/types.ts": "TypeScript type definitions for Location (with display name and coordinates) and GeocodingResult (with additional administrative region fields).",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that performs geocoding searches with debouncing (minimum 2 characters), caching results for 5 minutes.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "React component displaying Islamic prayer tutorial with gender-specific instructions, showing daily prayer rakat counts and step-by-step prayer guidance with Arabic text.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Content data defining prayer rakat counts for five daily prayers and detailed step-by-step prayer instructions for both men and women following Hanafi tradition in Turkey.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions for calculating great-circle distance between coordinates using Haversine formula and formatting distances for display (meters/kilometers).",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "React component for searching and selecting locations specifically for nearby mosque searches, with options to use temporarily or save as default location.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "API client that queries OpenStreetMap via Overpass API to fetch nearby mosques (place_of_worship with religion=muslim), calculates distances, and sorts results.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "React component that displays nearby mosques based on user location, with location search, temporary location selection, and integration with Google Maps for navigation.",
  "frontend/src/features/nearbymosque/types.ts": "TypeScript interface definition for NearbyMosque with id, name, coordinates, distance, and optional address.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook for fetching nearby mosques with caching, enabled only when coordinates are provided, with 5-minute stale time.",
  "frontend/src/features/notifications/notificationCopy.ts": "Centralized notification text templates for prayer times (fajr, dhuhr, asr, maghrib, isha, sunrise) with formatting utilities for time and lead minutes.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "React component for tracking daily prayers with checkboxes and managing kaza (missed prayer) counters with increment/decrement controls and manual input.",
  "frontend/src/features/prayer/aladhanApi.ts": "API client for fetching daily prayer times from Aladhan API using method 13, returning times for fajr, sunrise, dhuhr, asr, maghrib, and isha.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "API client for fetching 7-day prayer times from Aladhan API with formatted day labels in Turkish locale.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Computes three Islamic kerahat (prohibited prayer) time windows based on sunrise, dhuhr, and maghrib times, and merges them with prayer times into a chronologically sorted list.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "React component displaying prayer times with offset adjustment, kerahat (forbidden) time windows, and location prompt if no location is set.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to prayer times with 24-hour wraparound, supporting single times, daily prayer sets, and weekly prayer time arrays.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that fetches daily prayer times for a given location with 30-minute cache and retry logic.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook that fetches weekly prayer times for a given location with 30-minute cache and single retry.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays a Qibla compass using device orientation and location, with permission handling and visual compass UI showing direction to Kaaba.",
  "frontend/src/features/qibla/qiblaMath.ts": "Calculates the great-circle bearing from any geographic coordinate to the Kaaba in Mecca using spherical trigonometry.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that accesses device compass heading via DeviceOrientationEvent API with iOS 13+ permission handling.",
  "frontend/src/features/quran-reading/quranApi.ts": "Frontend API client for Al-Quran Cloud that fetches surah metadata, Arabic text, Turkish translations, and audio recitation URLs with in-memory caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "React component providing a Quran reader interface with surah list, Arabic text, Turkish translation toggle, audio playback controls, and persistent reading position.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "Custom React hook that manages audio playback for Quran ayahs, providing play/pause controls, navigation between ayahs, auto-play functionality, and state tracking (loading, error, time, duration).",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "Hook that manages and persists Quran reading state (last surah/ayah numbers and scroll position) using app settings.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content data defining fasting basics sections covering what fasting is, who must fast, how to fast, what breaks the fast, and recommended/prohibited behaviors.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Data file containing 30 daily Ramadan menu suggestions with sahur and iftar meal plans for each day.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "React component displaying Ramadan corner tab with prayer times (imsak/iftar), daily rotating menu, fasting basics, taravih information, and location setup dialog.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content data describing taravih prayer details including number of rakats, how to perform it, and notes about Ramadan observance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "Hook that returns a daily rotating Ramadan menu based on day of year, automatically updating at midnight using timeouts and intervals.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for local timezone date operations including start-of-day calculation, days-between computation, and Turkish locale date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri calendar events to Gregorian dates for a given year by scanning each day and using the browser's Intl API with Islamic calendar support.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Contains a hardcoded dataset of 15 Islamic religious days for 2026 with Turkish names, Gregorian dates, and corresponding Hijri month/day values.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "Defines TypeScript interfaces for Hijri events (with month/day) and computed religious days (with Gregorian date and display information).",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "Component displaying 2026 Islamic religious days in a list with highlighted next upcoming event and countdown in Turkish.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook that returns the fixed 2026 religious days list, identifies the next upcoming event, and calculates days remaining until it.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file with no content.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file with no content.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only React component for managing app release metadata (version and Play Store URL) with form inputs, validation, and success/error messaging.",
  "frontend/src/features/settings/appSettingsModel.ts": "Defines TypeScript types for app settings including location, prayer times, notifications, fasting tracking, prayer checklists, Quran progress, and Ramadan status.",
  "frontend/src/features/settings/durableLocationStorage.ts": "Provides IndexedDB-based persistent storage functions for saving, retrieving, and clearing user location data with error handling.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Manages localStorage and IndexedDB persistence for app settings including location, prayer times, notifications, fasting, adhkar, Quran progress, and prayer tracking with migration support.",
  "frontend/src/features/settings/SettingsTab.tsx": "React component providing UI for general app settings including prayer time offset adjustment and per-prayer notification lead time configuration.",
  "frontend/src/features/settings/useAppSettings.ts": "React hook that manages app settings using React Query, providing methods to load/save settings from local storage with default values for prayer times, notifications, Quran progress, fasting, and other Islamic app features.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Data file defining the structure and content of tasbihat items including Subhanallah, Alhamdulillah, Allahu Akbar, Kelime-i Tevhid, and Ayetel Kursi with Arabic text, transliterations, and translations.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "React component displaying post-prayer tasbihat (glorifications) in a scrollable card list, showing Arabic text, transliteration, translation, and repetition count for each phrase.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Compact weather display component showing temperature and weather description with a cloud icon, conditionally rendered only when location is set.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "API client for fetching weather data from Open-Meteo service and utility function to convert weather codes to Turkish descriptions.",
  "frontend/src/features/weather/useWeather.ts": "React Query hook for fetching and caching weather data based on location coordinates with 10-minute stale time.",
  "frontend/src/features/weather/WeatherSection.tsx": "Full weather section card component displaying temperature, weather description, wind speed, and humidity, with location prompt if no location is configured.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Digital tasbih (dhikr counter) component with increment/reset buttons, customizable target, progress bar, and persistent state saved to app settings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including color palettes for UI elements and prayer times, plus responsive typography utilities and safe area inset handling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/androidBridge.ts": "Provides safe wrapper functions for calling Android WebView bridge methods to send prayer time data to native Android layer for widgets and notifications, with graceful fallback for web browsers.",
  "frontend/src/utils/nativeNotifications.ts": "Utility for triggering native Android notifications via WebView JavaScript bridge with prayer-specific and generic notification helpers, including environment detection and app version retrieval.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both query strings and hash-based routing, including sessionStorage persistence for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining responsive breakpoints, custom color system using OKLCH, container settings, typography, and animation utilities for the application.",
  "project_state.json": "Project state tracking document showing in-progress responsive design implementation across the application, with focus on mobile optimization and location picker modal fixes."
}