{
  "backend/main.mo": "Main Motoko actor implementing user profiles, app settings (location/offset), sermon caching, and app release management with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting the removal of inline time offset adjustment UI from the homepage (PrayerTimesSection.tsx), since this functionality exists in Settings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styles, location/prayer/weather features, settings persistence, and component implementations.",
  "frontend/docs/android-webview-template.md": "Complete Android Studio template guide for wrapping the web app in a native Android WebView with JavaScript bridge, notifications, offline caching, and Play Store integration.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color system defining light/dark theme tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point loading Inter font, app icon, and android-widget-bridge.js before the main React bundle.",
  "frontend/public/android-widget-bridge.js": "Standalone JavaScript bridge providing global functions (updateNextPrayerWidget, updateDailyPrayersWidget, updateWeeklyPrayersWidget) and AndroidPrayer interface for Android WebView widget updates via SharedPreferences.",
  "frontend/src/androidPushBridge.d.ts": "TypeScript declarations for the AndroidPush interface that sends expanded prayer-times data (next prayer, daily/weekly arrays with timestamps) from WebView to native Android for SharedPreferences storage, alarm scheduling, and widget updates.",
  "frontend/src/androidWidgetBridge.d.ts": "TypeScript declarations for Android Widget Bridge global functions that update native Android widgets with prayer times using HH:MM format strings and timestamps for next prayer, daily prayers, weekly prayers, and city name.",
  "frontend/src/App.tsx": "Root React component with QueryClientProvider, tab navigation state, default location fallback logic, and rendering all feature tabs (Home, Settings, Qibla, Zikirmatik, etc.) with sticky header and mobile tabs navigation.",
  "frontend/src/components/AuthButton.tsx": "Empty React component that returns null, likely a placeholder for future authentication functionality.",
  "frontend/src/components/HeaderFlourish.tsx": "React component that displays a decorative Islamic divider flourish image centered in the header, hidden on mobile and semi-transparent.",
  "frontend/src/components/MobileTabsNav.tsx": "Mobile navigation component using tabs with icons for home, Esmaül Hüsna, Zikirmatik, Ramazan, and an overflow menu for additional features like Quran reading, prayer tracking, qibla finder, etc.",
  "frontend/src/components/SelectLocationPrompt.tsx": "Card component prompting users to select a location before viewing prayer times and weather, with a button to navigate to location selection.",
  "frontend/src/components/TabsOverflowMenu.tsx": "Dropdown menu component for mobile tabs navigation that displays additional features (Quran reading, prayer/fasting trackers, nearby mosques, religious days, qibla, settings, etc.) with icons.",
  "frontend/src/features/adhkar/adhkarData.ts": "Data file defining morning and evening adhkar items with Arabic text, transliteration, Turkish translation, and repetition counts for prayers like Ayetel Kürsi, Ihlas, Felak, Nas, and daily supplications.",
  "frontend/src/features/adhkar/MorningEveningAdhkarTab.tsx": "React component for displaying and tracking morning and evening adhkar (Islamic remembrances) with checkboxes for completion, reset buttons, and progress indicators using app settings persistence.",
  "frontend/src/features/app-release/currentAppVersion.ts": "Exports the current app version constant (\"1.0.0\") using semantic versioning, intended to be manually updated before each Play Store release.",
  "frontend/src/features/app-release/semverCompare.ts": "Provides semantic version comparison utilities (semverCompare, isNewerVersion) that parse and compare version strings in x.y.z format with fallback to string comparison.",
  "frontend/src/features/app-release/UpdateAvailablePrompt.tsx": "Dismissible alert component that prompts users to update the app when a newer version is available in the backend, with per-version dismissal tracking via localStorage.",
  "frontend/src/features/app-release/updatePromptStorage.ts": "LocalStorage utilities for persisting and retrieving the dismissed update version to prevent re-showing the same update prompt.",
  "frontend/src/features/app-release/useIsCallerAdmin.ts": "React Query hook that checks if the current caller has admin privileges via the backend actor, returning false by default on errors.",
  "frontend/src/features/app-release/useLatestAppRelease.ts": "React Query hook that fetches the latest app release metadata from the backend, gracefully returning null if unavailable or on error.",
  "frontend/src/features/app-release/useUpdateLatestAppRelease.ts": "React Query mutation hook for updating app release metadata (admin-only), invalidating the release query on success.",
  "frontend/src/features/dua-guide/duaGuideData.ts": "Data definitions and content for dua categories (travel, healing, abundance, anger, sustenance, general) with Arabic text, transliteration, and Turkish translations.",
  "frontend/src/features/dua-guide/DuaGuideTab.tsx": "Tab component displaying categorized Islamic duas (prayers) with category tabs, scrollable list, and a dialog showing full Arabic text, transliteration, and translation.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaCard.tsx": "Card component displaying a single name from Esmaul Husna (99 Names of Allah) with number badge, Arabic text, transliteration, and gradient background styling.",
  "frontend/src/features/esmaulhusna/esmaulHusnaData.ts": "Defines the EsmaulHusnaItem interface and exports an array of 99 names of Allah with Arabic text, transliteration, Turkish meanings, and associated duas.",
  "frontend/src/features/esmaulhusna/EsmaulHusnaTab.tsx": "Tab component rendering a grid of all 99 Names of Allah cards with a dialog showing detailed meaning and dua when a card is selected.",
  "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx": "Main component for tracking voluntary and make-up fasts, managing Ramadan day statuses, and displaying fasting statistics with add/remove functionality for dates.",
  "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx": "Displays a 30-day Ramadan fasting checklist with progress tracking, allowing users to mark each day as fasted or missed, and includes a reset dialog.",
  "frontend/src/features/hatim/HatimTakipTab.tsx": "Quran completion (Hatim) tracker that manages current page progress out of 604 total pages with increment/decrement controls and progress visualization.",
  "frontend/src/features/home/currentPrayerSlot.ts": "Determines the current prayer slot (fajr, sunrise, dhuhr, asr, maghrib, isha) based on adjusted prayer times and current time.",
  "frontend/src/features/home/formatRemainingTime.ts": "Formats milliseconds into zero-padded countdown strings: mm:ss for <1 hour, HH:mm:ss for ≥1 hour.",
  "frontend/src/features/home/HomeTab.tsx": "Main home screen component that orchestrates prayer times, weather, location setup, countdown timers, and Android widget updates with default location fallback.",
  "frontend/src/features/home/MotifButton.tsx": "Custom button component that wraps the base Button with a subtle Islamic tile pattern overlay for decorative styling.",
  "frontend/src/features/home/MotifFrame.tsx": "Decorative frame component with three variants (default, ornamental with corner decorations, divider with flourish) for Islamic-themed UI embellishment.",
  "frontend/src/features/home/NextPrayerCountdown.tsx": "Presentational component that displays the next prayer name, time, and countdown (mm:ss or HH:mm:ss format) received from parent to avoid duplicate bridge calls.",
  "frontend/src/features/home/PrayerTimeCardsSection.tsx": "Displays four prayer-time-specific cards (verse, hadith, dua, esma) with click-to-expand dialogs, using current prayer slot to fetch content.",
  "frontend/src/features/home/SahurIftarStrip.tsx": "Shows Ramadan sahur and iftar times with a countdown to the next target (sahur or iftar) in a three-column layout.",
  "frontend/src/features/home/time-content/duasData.ts": "Static data array of 20+ duas with Arabic text, Turkish translation, and occasion labels.",
  "frontend/src/features/home/time-content/hadithsData.ts": "Static data array of 20+ hadiths with Arabic text, Turkish translation, and source references.",
  "frontend/src/features/home/time-content/versesData.ts": "Defines VerseItem interface and exports an array of 24+ Quranic verses with Arabic text, Turkish translations, and references.",
  "frontend/src/features/home/useAndroidPushPrayerTimes.ts": "React hook that sends comprehensive prayer time data (next prayer, daily/weekly schedules with timestamps) to AndroidPush interface, deduplicating updates by comparing JSON payloads.",
  "frontend/src/features/home/useAndroidWidgetUpdates.ts": "React hook that sends daily and weekly prayer times to Android widgets via legacy and new bridge interfaces, deduplicating updates and including city name.",
  "frontend/src/features/home/useCurrentPrayerSlot.ts": "React hook that tracks the current prayer time slot (fajr, sunrise, dhuhr, asr, maghrib, isha) and updates every minute when the slot changes.",
  "frontend/src/features/home/useNextPrayerCountdown.ts": "React hook that computes the next prayer with live per-second countdown, exposes epoch timestamp and formatted time remaining, and sends updates to Android bridge when prayer changes.",
  "frontend/src/features/home/usePrayerTimeCardContent.ts": "React hook that selects random verse, hadith, dua, and Esma-ul Husna content for display cards, using prayer slot as seed for stable randomization within each slot.",
  "frontend/src/features/home/useSahurIftarCountdown.ts": "React hook that calculates countdown to next sahur (fajr) or iftar (maghrib) time based on current time, updating every minute with formatted time remaining.",
  "frontend/src/features/home/WeeklyPrayerTimesSection.tsx": "Renders a table of weekly prayer times (7 days) with sticky first column and highlights today's row.",
  "frontend/src/features/location/LocationSetupSection.tsx": "React component providing a location search UI with geocoding integration, allowing users to search and select a location that is saved to multiple storage mechanisms (durable storage, local storage, and app settings).",
  "frontend/src/features/location/openMeteoGeocoding.ts": "Implements geocoding functionality using the Open-Meteo API to search for locations by name and convert results to the app's Location type format.",
  "frontend/src/features/location/types.ts": "Defines TypeScript types for Location and GeocodingResult, and exports a DEFAULT_LOCATION constant for Istanbul, Turkey.",
  "frontend/src/features/location/useGeocodingSearch.ts": "React Query hook that wraps the geocoding search functionality with caching, debouncing (minimum 2 characters), and 5-minute stale time.",
  "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx": "React component displaying Islamic prayer tutorial content with gender-specific instructions, showing daily prayer rakat counts and step-by-step prayer guidance with Arabic text.",
  "frontend/src/features/namaz-ogretici/namazTutorialContent.ts": "Contains structured data for Islamic prayer tutorials including rakat counts for five daily prayers and detailed step-by-step instructions for men and women following Hanafi tradition.",
  "frontend/src/features/nearbymosque/distance.ts": "Utility functions implementing the Haversine formula to calculate great-circle distance between coordinates and format distances for display in meters or kilometers.",
  "frontend/src/features/nearbymosque/NearbyMosqueLocationSearch.tsx": "React component providing location search UI specifically for the nearby mosque feature, allowing users to select temporary or permanent locations with geocoding integration.",
  "frontend/src/features/nearbymosque/nearbyMosquesApi.ts": "Fetches nearby mosques from OpenStreetMap's Overpass API using coordinates and radius, then calculates distances and sorts results by proximity.",
  "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx": "React component displaying nearby mosques based on selected location, integrating location search and mosque listing with distance information and Google Maps links.",
  "frontend/src/features/nearbymosque/types.ts": "Defines the NearbyMosque interface with id, name, coordinates, distance, and optional address fields.",
  "frontend/src/features/nearbymosque/useNearbyMosques.ts": "React Query hook that fetches nearby mosques based on user coordinates and radius, with 5-minute cache and conditional enabling.",
  "frontend/src/features/notifications/notificationCopy.ts": "Centralized notification text templates for prayer times (Fajr, Dhuhr, Asr, Maghrib, Isha, Sunrise) with formatting utilities for time and lead minutes.",
  "frontend/src/features/prayer-tracker/PrayerTrackerTab.tsx": "React component for tracking daily prayer completion and managing kaza (missed prayer) counters with increment/decrement controls and progress display.",
  "frontend/src/features/prayer/aladhanApi.ts": "Fetches today's prayer times from Aladhan API using coordinates and calculation method 13, returning formatted times and date.",
  "frontend/src/features/prayer/aladhanWeeklyApi.ts": "Fetches 7-day prayer times from Aladhan API, iterating through dates and returning daily times with Turkish-formatted day labels.",
  "frontend/src/features/prayer/kerahatTimes.ts": "Calculates three kerahat (forbidden prayer) windows based on sunrise, dhuhr, and maghrib times, and merges them chronologically with prayer times for display.",
  "frontend/src/features/prayer/PrayerTimesSection.tsx": "Displays daily prayer times with icons, applies user offsets, and shows kerahat (forbidden prayer) windows merged chronologically with prayer times.",
  "frontend/src/features/prayer/timeOffset.ts": "Applies minute offsets to prayer times with 24-hour wraparound, supporting both individual times and full prayer/weekly time objects.",
  "frontend/src/features/prayer/usePrayerTimes.ts": "React Query hook that fetches today's prayer times for a given location with 30-minute cache and conditional enabling.",
  "frontend/src/features/prayer/useWeeklyPrayerTimes.ts": "React Query hook that fetches 7-day prayer times for a given location with 30-minute cache and conditional enabling.",
  "frontend/src/features/qibla/QiblaFinderTab.tsx": "React component that displays a Qibla (prayer direction) finder using device compass, showing an interactive compass UI with location selection dialog and permission handling for device orientation.",
  "frontend/src/features/qibla/qiblaMath.ts": "Utility functions for calculating the bearing from any geographic location to the Kaaba in Mecca using great-circle formulas and angle normalization.",
  "frontend/src/features/qibla/useDeviceOrientation.ts": "React hook that accesses device orientation API to get compass heading, handles iOS 13+ permission requests, and manages orientation event listeners.",
  "frontend/src/features/quran-reading/quranApi.ts": "API client for fetching Quran data from Al-Quran Cloud API, including surah metadata, Arabic text, Turkish translations, and audio recitation URLs with in-memory caching.",
  "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx": "React component providing a Quran reader interface with surah list/reader views, audio playback controls, translation toggle, and reading state persistence with scroll position restoration.",
  "frontend/src/features/quran-reading/useAyahAudioPlayer.ts": "React hook managing audio playback for Quran ayahs with play/pause controls, sequential playback, error handling, and time tracking using HTML5 Audio API.",
  "frontend/src/features/quran-reading/useQuranReadingState.ts": "React hook for persisting and restoring Quran reading progress (last surah, ayah, and scroll position) using app settings storage.",
  "frontend/src/features/ramazan/fastingBasicsContent.ts": "Static content defining fasting basics in Turkish, covering what fasting is, who must fast, how to fast, what breaks the fast, and recommended/prohibited behaviors during fasting.",
  "frontend/src/features/ramazan/ramadanMenusData.ts": "Data file containing 30 daily Ramadan meal plans (sahur and iftar menus) with Turkish food items for each day of Ramadan.",
  "frontend/src/features/ramazan/RamazanKosesiTab.tsx": "React component that displays Ramadan information including prayer times (imsak/iftar), daily rotating menu, fasting basics, and Tarawih prayer details. Prompts for location setup if not configured.",
  "frontend/src/features/ramazan/tarawihContent.ts": "Static content describing Tarawih prayer in Turkish, including how many rakats, how to perform it, and notes about Ramadan observance.",
  "frontend/src/features/ramazan/useDailyRotatingRamadanMenu.ts": "React hook that returns a daily rotating Ramadan menu based on day-of-year calculation, automatically updating at midnight using timeouts and intervals.",
  "frontend/src/features/religious-days/dateMath.ts": "Utility functions for local date calculations including start-of-day normalization, days-between computation, and Turkish locale date formatting.",
  "frontend/src/features/religious-days/hijriLocalConversion.ts": "Converts Hijri calendar events to Gregorian dates for a given year by scanning each day using browser's Intl API with Islamic calendar support.",
  "frontend/src/features/religious-days/religiousDaysData.ts": "Fixed dataset of 2026 Islamic religious days with hardcoded Gregorian dates, Turkish names, and Hijri calendar references for 15 events including Eids and Kandils.",
  "frontend/src/features/religious-days/religiousDaysModel.ts": "TypeScript type definitions for Hijri events and computed Gregorian religious day instances, including date, display format, and calendar metadata.",
  "frontend/src/features/religious-days/ReligiousDaysTab.tsx": "React component displaying 2026 Islamic religious days in Turkish, highlighting the next upcoming event with countdown and showing a full yearly list with past/future indicators.",
  "frontend/src/features/religious-days/useReligiousDaysForYear.ts": "React hook that returns fixed 2026 religious days data with computed next upcoming event and days remaining logic based on current date.",
  "frontend/src/features/sermon/CumaHutbesiTab.tsx": "Empty file with no content.",
  "frontend/src/features/sermon/useLatestSermon.ts": "Empty file with no content.",
  "frontend/src/features/settings/AdminAppReleaseAdvancedSection.tsx": "Admin-only UI component for managing app release metadata (version and Play Store URL) with form inputs, validation, success/error messaging, and immediate UI updates.",
  "frontend/src/features/settings/appSettingsModel.ts": "TypeScript model definitions for app settings including location, prayer times, notifications, zikirmatik, hatim, adhkar, fasting, Ramadan tracking, prayer checklists, kaza counters, and Quran reading progress.",
  "frontend/src/features/settings/durableLocationStorage.ts": "Multi-layer location persistence utility using IndexedDB as primary storage with localStorage and sessionStorage backups for redundancy and validation.",
  "frontend/src/features/settings/localSettingsStorage.ts": "Local settings storage layer with versioned localStorage persistence, migration logic, and multi-layer location recovery strategy using durable storage and manual location backups.",
  "frontend/src/features/settings/SettingsTab.tsx": "Settings UI component with cards for general settings (prayer time offset adjustment) and notification lead time configuration for each prayer with save functionality.",
  "frontend/src/features/settings/useAppSettings.ts": "React Query hook for managing app settings with async load/save operations, default values, and both new and legacy API compatibility.",
  "frontend/src/features/tasbihat/tasbihatData.ts": "Defines the TasbihatItem interface and exports an array of Islamic prayer phrases (Sübhanallah, Elhamdülillah, Allahu Ekber, Kelime-i Tevhid, Ayetel Kürsi) with Arabic text, transliterations, translations, and count targets.",
  "frontend/src/features/tasbihat/TasbihatTab.tsx": "UI component displaying post-prayer tasbihat (dhikr phrases) with Arabic text, transliteration, translation, and repetition counts in scrollable card layout.",
  "frontend/src/features/weather/CompactWeatherSummary.tsx": "Renders a compact weather summary component showing temperature and weather description with a cloud icon, returning null if no location is set.",
  "frontend/src/features/weather/openMeteoWeatherApi.ts": "Provides API integration with Open-Meteo weather service, fetching current weather data and mapping weather codes to Turkish descriptions.",
  "frontend/src/features/weather/useWeather.ts": "Custom React Query hook that fetches weather data for a given location with 10-minute cache and retry logic.",
  "frontend/src/features/weather/WeatherSection.tsx": "Displays a detailed weather card with temperature, weather description, wind speed, and humidity information for the user's selected or default location.",
  "frontend/src/features/zikirmatik/ZikirmatikTab.tsx": "Implements a digital tasbih (prayer counter) with increment, reset, target setting, and progress tracking features, persisting state to app settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using vivid jewel tones, prayer-time-specific colors, and responsive typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/androidBridge.ts": "Provides safe helper functions to communicate with Android WebView bridge for sending prayer time data (next prayer, daily prayers, weekly prayers) to native Android layer with input validation and error handling.",
  "frontend/src/utils/nativeNotifications.ts": "Provides interface for triggering native Android notifications via WebView JavaScript bridge with functions to send generic, prayer-specific notifications and check bridge availability.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), container settings, typography, animations, and plugins for a prayer times application.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, and feature requests including removal of duplicate clock adjustment UI from homepage that already exists in settings page."
}