{
  "kind": "build_request",
  "title": "Fix weekly prayer times table overlap by making Day/Date column sticky during horizontal scroll",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Weekly Prayer Times table on mobile so horizontal scrolling does not cause the left Day/Date column to visually overlap/merge with the time columns; the left column must remain readable and visually separated while scrolling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Ben derdimi anlatamadım galiba haftalık ezan vakitleri penceresiinde vakitler sola doğru gidince tarihler altında kalıyor görüntü böyle oluncada yazılar okunmuyor",
          "düzlet"
        ]
      },
      "acceptanceCriteria": [
        "On narrow/mobile widths, the weekly table scrolls horizontally inside its own container (not the whole page).",
        "While horizontally scrolling, the first column (Day/Date) stays fixed on the left and never gets covered by other columns’ text.",
        "The sticky first column has an opaque background so underlying cells do not show through.",
        "A visible separator (border and/or shadow) remains between the sticky first column and the scrollable time columns in both light and dark mode."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Weekly Prayer Times sticky-column styling is consistent for both header and body cells (layering, background treatment, and separator), preventing any header/body mismatch or z-index issues during horizontal scroll.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "haftalık ezan vakitleri penceresiinde vakitler sola doğru gidince tarihler altında kalıyor"
        ]
      },
      "acceptanceCriteria": [
        "The sticky header cell and sticky body cells share consistent `position: sticky; left: 0;` behavior and visually match (background + separator).",
        "Z-index layering is correct so the sticky column (including header) always appears above scrollable columns, with no flicker when scrolling.",
        "The 'today' row styling does not reduce readability of the sticky column and remains consistent while scrolling."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit any paths listed as immutable in SYSTEM_CONTEXT (compose around them instead)."
  ],
  "nonGoals": [
    "No changes to prayer time calculation or API fetching logic.",
    "No new features or UI sections beyond fixing the weekly table scroll/overlap behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}