{
  "kind": "build_request",
  "title": "Show seconds in persistent next-prayer countdown (mm:ss)",
  "projectName": "Hadi Namaza",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the next-prayer countdown logic so the remaining time is computed and updated every second (instead of every minute) and formatted with seconds for display as mm:ss (and as HH:mm:ss when the remaining time is 1 hour or more).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Uygulamada kalıcı bildirim kısmında kalan vakit gözüküyor ancak geri sayım sadece dakikaya kadar var ben saniyeleri de saysın istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "When the next-prayer time is in the future, the countdown value changes once per second in the UI state produced by the countdown hook.",
        "For remaining durations under 1 hour, the displayed remaining time uses a zero-padded mm:ss format (e.g., 04:09).",
        "For remaining durations of 1 hour or more, the displayed remaining time uses a zero-padded HH:mm:ss format (e.g., 01:04:09).",
        "The calculation uses the existing nextPrayerMillis target time and the current time, so seconds count down smoothly without skipping minutes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the AndroidPush payload field `timeRemaining` receives the same seconds-inclusive countdown string so the Android persistent notification can display seconds-based countdown (mm:ss / HH:mm:ss).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "kalıcı bildirim kısmında kalan vakit gözüküyor ancak geri sayım sadece dakikaya kadar var ben saniyeleri de saysın istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "The JSON payload sent via `sendPrayerTimesToAndroidPush` includes `timeRemaining` in mm:ss (or HH:mm:ss) format matching the app countdown output.",
        "While the countdown is running, updates to `timeRemaining` can be observed propagating through the `useAndroidPushPrayerTimes` hook (i.e., no stale minute-only formatting remains)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep existing bridge update behavior for next-prayer identity (name and timestamp/time-string) so that Android bridge calls that should only happen on next-prayer changes are not spammed by the new per-second countdown updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "başla"
        ]
      },
      "acceptanceCriteria": [
        "`sendNextPrayerToAndroid` and `sendNextPrayerWithTimeString` are still invoked only when the next prayer (or its scheduled time) changes, not every second.",
        "No new per-second calls are added to the legacy next-prayer widget bridge functions beyond what is required for `timeRemaining` updates through AndroidPush payloads."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under the immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not introduce or depend on changes to the native Android app code; implement the change by adjusting the web app countdown formatting/update cadence and the existing AndroidPush payload field(s)."
  ],
  "nonGoals": [
    "Changing prayer time calculation logic or offsets.",
    "Adding new notification types or changing notification copy content.",
    "Updating the Sahur/Iftar countdown behavior (only the persistent next-prayer countdown is in scope)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}