{
  "kind": "build_request",
  "title": "Make the selected location persist reliably (not cleared over time)",
  "projectName": "Hadi Namaza",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist the user-selected location in a more durable client-side store than localStorage (to survive Android WebView storage cleanup) and use it as the app’s canonical saved location until the user changes it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ekle seçilen konum silinmesin"
        ]
      },
      "acceptanceCriteria": [
        "After selecting a location, the app still shows the same selected location after closing and reopening the app.",
        "If localStorage is empty/cleared but the durable store still has the saved location, the app restores and uses that location automatically.",
        "If both stores are empty, the app behaves as today (location is null and user is prompted to select one)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the app settings load/save flow so location changes are written to durable storage and localStorage before any UI close/navigation actions that depend on the saved location (e.g., closing the location picker dialog).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ekle seçilen konum silinmesin"
        ]
      },
      "acceptanceCriteria": [
        "When a user selects a location in the location picker, the dialog closes only after the save completes successfully.",
        "On immediate app refresh/reopen after selecting a location, the same location is loaded and displayed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure all location selection entry points intended to affect the default app location update the same persisted app settings `location` field and never reset it to null/default on mount or when switching tabs (including flows that offer “save as default” vs “temporary”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ekle seçilen konum silinmesin"
        ]
      },
      "acceptanceCriteria": [
        "Choosing “save as default” in any location search flow updates the same persisted `settings.location` used by Home/Prayer Times/Weather.",
        "Temporary location choices do not overwrite the persisted default location.",
        "No component sets `settings.location` to null unless the user explicitly performs a clear/reset action."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep all backend logic in the existing single Motoko actor (backend/main.mo); only add backend changes if strictly necessary for this persistence fix."
  ],
  "nonGoals": [
    "Fixing prayer-time notifications/alarm delivery on Android.",
    "Adding new authentication methods beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}