{
  "kind": "build_request",
  "title": "Enable ayah audio playback via Al Quran Cloud (Play button should produce sound)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Quran reader audio playback so that pressing the Play button reliably starts audible ayah recitation for all ayahs, using Al Quran Cloud / Islamic Network CDN MP3 URLs (e.g., https://cdn.islamic.network/quran/audio/128/ar.alafasy/{ayahNo}.mp3).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ekle ve artık playe basınca ayetleri duyalım",
          "Ayetleri dinlemek iisteyince playe basınca ses gelmiyor",
          "🎧 Al Quran Cloud API"
        ]
      },
      "acceptanceCriteria": [
        "In the “QuranOgreniyorumTab” reader view, tapping the main Play button starts audible playback (not silent) for the currently selected ayah.",
        "The audio source used is a valid HTTPS MP3 URL from Al Quran Cloud API response (audio field) and/or the Islamic Network CDN format provided by the user; playback must not depend on any backend changes.",
        "If the current ayah’s audio URL is missing/empty, the UI must show a clear error state and not attempt to play an empty source.",
        "Next/Previous ayah controls continue playback correctly when autoPlayNext is enabled.",
        "Errors from the HTMLAudioElement (load/play failures) are surfaced in the existing error area in the audio controls."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the ayah-level “Listen” action plays the selected ayah even if audio was not already playing, and does not remain silent due to an unset/empty audio source.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "playe basınca ses hiç başlamıyor tüm ayetlerde aynı sorun var"
        ]
      },
      "acceptanceCriteria": [
        "Tapping an ayah’s “Listen” button sets the player to that ayah and starts audible playback immediately.",
        "If the selected ayah audio URL is not available, the app shows an error and does not enter a playing state."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing Shadcn components only).",
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not add any third-party auth provider; Internet Identity remains the only supported auth mechanism (not required for this change).",
    "Keep all backend logic in a single Motoko actor; avoid backend changes unless strictly necessary for audio playback."
  ],
  "nonGoals": [
    "Adding offline audio download/caching features.",
    "Adding background music or continuous playlist across different surahs beyond the existing next/previous ayah behavior.",
    "Implementing a new backend proxy for audio; audio should be fetched/played directly from the external HTTPS sources in the client."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}