{
  "kind": "build_request",
  "title": "Fix location persistence in localStorage for mobile devices",
  "projectName": "Namaz Vakti",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure manually selected location data persists in localStorage even after cache clearing on mobile devices. The location storage must survive browser cache/data clearing and app closure/reopening scenarios.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "MOBİL CİHAZLARDA KULLANIRKEN",
          "UYGULAMADA ÖN BELLEK TEMİZLEME YAPINCA KONUM SİLİNİYOR",
          "Manuel seçilen konum bilgisi, uygulamadan çıkış yapıldığında ön bellek temizleme nedeniyle kayboluyor"
        ]
      },
      "acceptanceCriteria": [
        "Location data saved to localStorage with a dedicated key",
        "Location persists after browser cache is cleared",
        "Location persists after app is closed and reopened on mobile devices",
        "App loads and functions correctly with the saved location on restart"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent app from crashing or becoming non-functional when cache is cleared. If location data is unavailable, display the location selection prompt instead of breaking the application.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "uygulamadan çıkış yapınca da ön bellek temizleme yapılıyor ve uygulama çalışmıyor"
        ]
      },
      "acceptanceCriteria": [
        "App displays SelectLocationPrompt component when no location is available",
        "App does not crash or throw errors when localStorage is empty",
        "All prayer times, weather, and location-dependent features handle missing location gracefully"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add fallback mechanism to provide a default location if localStorage is completely cleared and no location has been selected. Use a sensible default location for Turkey (e.g., Istanbul coordinates) to ensure basic functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "İlk kullanımda konum seçilmezse varsayılan bir konum gösterilecek"
        ]
      },
      "acceptanceCriteria": [
        "Default location (Istanbul or similar) is defined as a constant",
        "Default location is used only when localStorage is empty and no selection has been made",
        "App displays prompt to encourage user to select their actual location",
        "Prayer times and weather data load correctly with the default location"
      ]
    }
  ],
  "constraints": [
    "Do not implement Internet Identity authentication (explicitly not used in this app)",
    "Must work on mobile browsers without requiring native app features",
    "Location data must survive aggressive cache clearing on mobile browsers"
  ],
  "nonGoals": [
    "GPS-based automatic location detection",
    "Backend storage of location data in Internet Computer canisters",
    "User authentication or multi-user location preferences",
    "Location history or multiple saved locations"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}