{
  "kind": "build_request",
  "title": "Make Namaz Öğretici text-only with single-page men/women flows (remove all images and swipe UI)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update the Namaz Öğretici tab to remove the step-by-step/swipe tutorial UI entirely (no swipe gestures, no step indicator dots, no previous/next controls, and no per-step paging). Instead, show a single scrollable page of text content for the selected gender flow (Men/Women).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "öğretici kısmında görselleri kaldır sadece yazılar kalsın görseller yanıltıcı olabilir",
          "2- adım adım değilde kadın erkek olarak tek bir sayfada metin olarak göster",
          "evet"
        ]
      },
      "acceptanceCriteria": [
        "In the Namaz Öğretici tab, there are no swipe handlers, no pagination state (current step), no step dots, and no previous/next buttons rendered.",
        "For the selected gender (Men or Women), all tutorial steps are displayed in order on one long, scrollable page.",
        "Switching between Men and Women updates the page content immediately and does not cause any out-of-range/index errors."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Remove all tutorial images from the Namaz Öğretici experience: do not render any <img> for steps and remove any runtime dependency on tutorial image asset paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "öğretici kısmında görselleri kaldır sadece yazılar kalsın görseller yanıltıcı olabilir",
          "1-evet ... 3-evet görsel setler iptal"
        ]
      },
      "acceptanceCriteria": [
        "Namaz Öğretici renders no step images in the UI.",
        "The app does not reference /assets/generated/namaz-*.png (or any step image filenames) from the Namaz Öğretici screen at runtime."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Refactor the Namaz Öğretici built-in content model in frontend/src/features/namaz-ogretici/namazTutorialContent.ts to support the text-only tutorial: remove the need for per-step imagePath fields and ensure both menNamazSteps and womenNamazSteps remain complete, ordered, and stable via their existing step ids.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "3-evet görsel setler iptal"
        ]
      },
      "acceptanceCriteria": [
        "The Namaz tutorial step type no longer requires an imagePath field.",
        "menNamazSteps and womenNamazSteps still export stable step ids and all text fields needed to render the single-page tutorial (title, description, and optional arabicText).",
        "Namaz Öğretici builds and renders successfully after the refactor without TypeScript errors related to removed image fields."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose-only).",
    "Keep the Internet Computer backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Do not change the bottom tab/navigation structure beyond updating the Namaz Öğretici tab’s internal content.",
    "Do not add new illustration assets for the Namaz tutorial (the image set is canceled).",
    "Do not modify prayer times, location, weather, Esmaül Hüsna, Zikirmatik, or Settings behaviors as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}