{
  "kind": "build_request",
  "title": "Add a 30-day Ramadan fasting checklist to the Fasting Tracker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a dedicated \"Ramadan (30 days)\" tracking section to the existing Fasting Tracker tab that lets the user mark/unmark each of 30 days as completed, shows progress (e.g., X/30), and provides a one-tap reset/clear action for the Ramadan checklist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Oruç Takibinde Ramazan Ayı içinde 30 gün işaretlemeli şekilde bir takip sistemi yap"
        ]
      },
      "acceptanceCriteria": [
        "The Fasting Tracker tab includes a Ramadan checklist UI with exactly 30 individually toggleable day items (Day 1 … Day 30).",
        "Toggling a day immediately updates the displayed progress count.",
        "A reset/clear control is available to unmark all 30 days in one action (with a confirmation step or clearly safe UX).",
        "The Ramadan section does not interfere with existing 'voluntary' and 'make-up' fasting tracking features."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the Ramadan 30-day checklist state in local settings so it remains after reload, and implement a forward-compatible localStorage migration for the new settings fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "30 gün işaretlemeli şekilde bir takip sistemi yap"
        ]
      },
      "acceptanceCriteria": [
        "Ramadan checklist completion state persists across page refreshes and app restarts.",
        "No runtime errors occur for existing users with older localStorage data; settings load successfully and new Ramadan fields default to an empty/unmarked state.",
        "Local settings versioning is incremented and older versions migrate without data loss for existing settings fields (location, offsets, adhkar, fasting dates, etc.)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Ramadan checklist UI is mobile-friendly and consistent with the app’s existing warm theme (cards, badges, separators), including a compact layout (e.g., responsive grid or list) suitable for 30 items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ramazan Ayı içinde 30 gün işaretlemeli"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the 30-day UI remains readable and usable without horizontal scrolling.",
        "Visual styling matches existing components used in the Fasting Tracker tab (Card/Badge/Button/etc.)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services or external databases."
  ],
  "nonGoals": [
    "Do not implement notifications, reminders, or push messaging for Ramadan days (not requested).",
    "Do not implement server-side persistence or multi-device sync for the Ramadan checklist (local persistence is sufficient unless explicitly requested).",
    "Do not add new authentication methods beyond the existing Internet Identity setup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}