{
  "kind": "build_request",
  "title": "Provide complete Android WebView wrapper spec (offline cache, native notifications, insets, Play Store version checks) and add web safe-area padding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand `frontend/docs/android-webview-template.md` into a complete, “final and complete” Android Studio WebView wrapper guide that includes the full Kotlin/Gradle/manifest/resource code (as sequential, copy-pasteable files) for: (1) offline-first WebView caching using `WebSettings.cacheMode = WebSettings.LOAD_CACHE_ELSE_NETWORK`, (2) a JavaScript bridge that converts web-triggered notification calls into visible native Android notifications (compatible with the existing web bridge expectations like `window.Android.showNotification(title, body)` and `window.AndroidPush.sendPrayerTimes(json)`), (3) runtime notification permission handling for Android 13+ (`POST_NOTIFICATIONS`) plus a user-facing option to open system notification settings after setup, (4) scheduled prayer-time alarms and an ongoing/persistent status-bar notification showing the next scheduled prayer time, (5) Play Store version checking and a native notification when a new version is available, and (6) edge-to-edge / WindowInsets handling so the WebView content does not render under the status bar or navigation bar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "şimdi senden android stuidoda uygulamanın  Öncelikle webSettings.cacheMode = WebSettings.LOAD_CACHE_ELSE_NETWORK kod ile çevrımdışı önyükelemeli çalışsın istiyorum... uygulama android tarafında push bildirim versin istiyorum... Bildirim ayarları kurulup yapınca açılması için seçenek sunulsun... sıradaki vakitte sabit bir bildirim olarak bildirim çubuğunda görüntülenebilsin... google play storede sürüm kontrolü yapılabilsin yeni sürüm gelince bildirim versin... ekran mobil cihazlarda ... taşsın istemiyorum... gerekli olan android studio dosyalarının kodlarını metin olarak sırayla gönderebilir misin?",
          "başla"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/docs/android-webview-template.md` contains a clear file-by-file sectioned layout (e.g., AndroidManifest.xml, MainActivity.kt, WebAppInterface.kt, FirebaseMessagingService, receivers, helpers, Gradle files, XML layouts, required resources) with complete code blocks for each file.",
        "The doc explicitly includes the WebView caching configuration with `LOAD_CACHE_ELSE_NETWORK` and any other required WebSettings to support offline-friendly behavior.",
        "The doc specifies a JS bridge contract that matches the existing web app typings/usages (e.g., `window.Android.showNotification(title, body)`, `window.Android.getAppVersion()`, and `window.AndroidPush.sendPrayerTimes(json)` or fallback `send(json)`).",
        "The doc includes Android 13+ notification permission flow and a concrete “Open notification settings” intent option for the user.",
        "The doc includes a concrete approach and code for scheduling the next prayer notification and showing an ongoing (non-dismissible) notification for the upcoming prayer time.",
        "The doc includes code and instructions for Play Store version checking and notifying the user when an update is available.",
        "The doc includes edge-to-edge / WindowInsets handling code ensuring the WebView content is inset-aware (status/navigation bars do not cover content)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add safe-area (status bar / navigation bar) padding support to the React web UI so that when hosted inside an edge-to-edge Android WebView, the app content respects device cutouts and system bars using CSS env safe-area inset variables.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ayrııca ekran mobil cihazlarda ne üst kısımdaki şart ve bildirim alanına taşsın ne de alt kısımda menu ve geri tuş kısmına taşsın istemiyorum."
        ]
      },
      "acceptanceCriteria": [
        "Global CSS defines a reusable safe-area padding utility (or equivalent) using `env(safe-area-inset-top)`, `env(safe-area-inset-bottom)`, `env(safe-area-inset-left)`, and `env(safe-area-inset-right)`.",
        "The top-level app container applies the safe-area padding so header/content/bottom navigation never render under system UI when the WebView uses edge-to-edge.",
        "No user-facing text is introduced in Turkish as part of this change (keep user-facing strings English for any new copy)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (read-only UI components).",
    "Do not edit immutable frontend hook paths listed in SYSTEM_CONTEXT (compose around them instead).",
    "Keep all backend logic in the single Motoko actor (`backend/main.mo`) and only add a migration file if state schema changes are required (not expected for this request)."
  ],
  "nonGoals": [
    "Implementing native Android/Kotlin code as compiled project artifacts inside this Internet Computer app repository (the deliverable here is documentation + web-side safe-area support).",
    "Adding real Web Push / Service Worker push notifications to the web app (not supported in Android WebView).",
    "Adding third-party auth providers or non-Internet-Identity authentication changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}