{
  "kind": "build_request",
  "title": "Fix Cuma Hutbesi loading failure and make sermon retrieval fast and reliable",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "Fix the Diyanet listing URL used by the backend sermon fetch so it matches the provided URL exactly (https://dinhizmetleri.diyanet.gov.tr/kategoriler/yayinlarimiz/hutbeler/t%C3%BCrk%C3%A7e) and is not double-URL-encoded.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Failed to Load Sermon\nCould not find sermon link on listing page",
          "Hızlı bir şekilde yüklensin istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "Backend uses the exact Diyanet URL string (no double-encoding of % characters).",
        "Calling the existing backend method that fetches the listing page returns valid HTML for the listing page (not a redirect/error page)."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Add a new backend update method that fully retrieves and parses the latest hutbe and returns a structured result (title, date, content) to the frontend, so the frontend does not need to parse the listing page or fetch the detail page in the browser.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Failed to Load Sermon\nCould not find sermon link on listing page"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a canister method that returns {title, date, content} for the latest sermon.",
        "Backend method performs all required HTTPS fetch(es) (listing + detail) via IC HTTP outcalls and does not require any browser fetch to Diyanet.",
        "Backend parsing is resilient enough to find the latest sermon link even if the listing page CSS classes change (do not rely solely on a single brittle selector equivalent).",
        "If parsing fails, the backend returns a clear error (trap/message) that the frontend can display."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add backend-side caching for the latest parsed hutbe so the Cuma Hutbesi screen loads quickly on repeat visits, while still allowing refresh to fetch the newest sermon.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Hızlı bir şekilde yüklensin istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "Backend caches the most recently fetched/parsed sermon result with a timestamp.",
        "Within the cache TTL, repeated calls return quickly from cache without re-fetching Diyanet.",
        "There is a way for the frontend refresh action to bypass or revalidate the cache (e.g., a forceRefresh flag or a separate method)."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the frontend Cuma Hutbesi data flow to call the new backend structured sermon method (instead of parsing the listing HTML in the browser and instead of fetching the sermon detail page with window.fetch), and keep all new Cuma Hutbesi-specific user-facing text in English (tab label remains exactly “Cuma Hutbesi”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Failed to Load Sermon\nCould not find sermon link on listing page",
          "Hızlı bir şekilde yüklensin istiyorum"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/features/sermon/useLatestSermon.ts no longer uses DOMParser to find the sermon link from the listing HTML.",
        "Frontend no longer calls fetch(fullSermonUrl) to Diyanet from the browser (avoids CORS and long waits).",
        "Cuma Hutbesi tab shows loading skeleton quickly and then renders title/date/content from backend response.",
        "Any new error/loading/empty-state text introduced for this change is in English; the existing tab label remains exactly “Cuma Hutbesi”."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Tune React Query behavior for the sermon query to improve perceived speed: keep previous sermon content visible while a background refetch is happening, and avoid unnecessary refetch loops that cause long loading on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "çok uzun süre bekledi"
        ]
      },
      "acceptanceCriteria": [
        "When the user taps Refresh/Retry, the UI indicates fetching without blanking already-displayed sermon content (if available).",
        "React Query caching settings prevent frequent refetches during normal navigation (staleTime and refetch behavior are set to mobile-friendly defaults).",
        "If the backend returns cached content quickly, the tab renders content without showing the error state seen previously."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only generate backend/migration.mo if a stable-state upgrade is required for new cached sermon state.",
    "Do not edit frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose existing hooks/components instead)."
  ],
  "nonGoals": [
    "Changing the bottom tab structure or renaming the “Cuma Hutbesi” tab label.",
    "Adding third-party integrations or external databases.",
    "Implementing real-time updates (WebSockets/push notifications) for sermons."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text introduced for the Cuma Hutbesi feature (tab label stays “Cuma Hutbesi”)."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}