{
  "kind": "build_request",
  "title": "Show 7-day prayer times on the Home page for the selected location",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new frontend data-fetching utility that retrieves prayer times for the next 7 days (today + 6 days) using the same Aladhan API currently used for daily prayer times, parameterized by the currently selected location (latitude/longitude).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "1-mevcut kullandığın apılerden devam et 2-tablo liste şeklinde olsun mevcut tasarımlara uysun 3-seçili olan konum için"
        ]
      },
      "acceptanceCriteria": [
        "When a location is selected, the app fetches prayer times for 7 consecutive days using Aladhan (same provider as current daily timings).",
        "The query is disabled when there is no selected location, and surfaces a user-friendly error state if the request fails.",
        "The React Query cache key includes the selected location coordinates so changing location refetches the 7-day data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Render a 7-day prayer times section on the Home page (frontend/src/features/home/HomeTab.tsx) that matches the existing Home design language and presents the weekly data in a table/list format.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Anasayfada mevcut bilgilere ek olarak 1 haftalık Namaz Vaktini gösterebilir misin?",
          "1-mevcut kullandığın apılerden devam et 2-tablo liste şeklinde olsun mevcut tasarımlara uysun 3-seçili olan konum için"
        ]
      },
      "acceptanceCriteria": [
        "If no location is selected, the weekly section is not shown (the existing location setup UI remains the only prompt).",
        "When weekly data is available, the Home page displays 7 rows (one per day) and columns (or labeled fields) for at least: İmsak (Fajr), Güneş (Sunrise), Öğle (Dhuhr), İkindi (Asr), Akşam (Maghrib), Yatsı (Isha), plus the date/day label.",
        "The weekly display respects the user’s configured offset (settings.offsetMinutes) consistently across all shown times, using the same offset behavior as the existing daily Home list.",
        "Loading and error states are styled consistently with existing HomeTab patterns (e.g., muted loading text, destructive error text) and do not break layout on mobile."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not introduce a new backend service; keep prayer time retrieval on the frontend using the existing API approach.",
    "Keep all user-facing text in the build request in English (the app’s existing Turkish UI copy can remain as-is unless explicitly changed)."
  ],
  "nonGoals": [
    "Adding a new location selection flow or changing how the selected location is stored.",
    "Changing the prayer time calculation method or the Aladhan method parameter currently used for daily timings.",
    "Adding notifications or reminders for the weekly schedule."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}