{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Quran reader ayah audio playback using Al Quran Cloud / Islamic Network MP3 URLs",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the main Play button in QuranOgreniyorumTab reliably start audible ayah recitation using valid Al Quran Cloud audio URLs and/or Islamic Network CDN MP3 fallbacks, with robust error handling and correct next/previous behavior.",
      "acceptanceCriteria": [
        "In the “QuranOgreniyorumTab” reader view, tapping the main Play button starts audible playback (not silent) for the currently selected ayah.",
        "The audio source used is a valid HTTPS MP3 URL from Al Quran Cloud API response (audio field) and/or the Islamic Network CDN format provided by the user; playback must not depend on any backend changes.",
        "If the current ayah’s audio URL is missing/empty, the UI must show a clear error state and not attempt to play an empty source.",
        "Next/Previous ayah controls continue playback correctly when autoPlayNext is enabled.",
        "Errors from the HTMLAudioElement (load/play failures) are surfaced in the existing error area in the audio controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/quran-reading/quranApi.ts",
          "operation": "modify",
          "description": "Ensure each Ayah returned by getSurahContent has a valid HTTPS MP3 audio URL: prefer the Al Quran Cloud API-provided audio field, and when missing/empty, derive a fallback Islamic Network CDN MP3 URL using the ayah's global number so the player never receives empty sources for normal cases."
        },
        {
          "path": "frontend/src/features/quran-reading/useAyahAudioPlayer.ts",
          "operation": "modify",
          "description": "Harden the audio hook to prevent silent playback: validate current ayah URL before attempting to play, surface a clear error when missing/invalid, and ensure autoPlayNext advances to the next ayah and continues playback (not just changing index). Also improve HTMLAudioElement error propagation to the existing error string and avoid entering a playing state when play() fails."
        },
        {
          "path": "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx",
          "operation": "modify",
          "description": "Wire the reader UI to the improved audio behavior: ensure the main Play button cannot trigger playback when the current ayah URL is empty (showing the hook error), and verify Next/Previous controls keep audio playing when appropriate, while continuing to display HTMLAudioElement errors in the existing error area."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the ayah-level “Dinle/Listen” action select the tapped ayah and start audible playback immediately, without becoming silently 'playing' when audio source is unset/empty.",
      "acceptanceCriteria": [
        "Tapping an ayah’s “Listen” button sets the player to that ayah and starts audible playback immediately.",
        "If the selected ayah audio URL is not available, the app shows an error and does not enter a playing state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/quran-reading/useAyahAudioPlayer.ts",
          "operation": "modify",
          "description": "Add/adjust a control path that atomically selects an ayah index and starts playback only after a non-empty audio source is set (e.g., a dedicated control method that sets index + triggers playback with proper sequencing). Ensure missing URL results in an error and no playing state."
        },
        {
          "path": "frontend/src/features/quran-reading/QuranOgreniyorumTab.tsx",
          "operation": "modify",
          "description": "Update the per-ayah “Dinle” button handler to use the hook's select-and-play control so tapping it always plays the selected ayah immediately; if the selected ayah has no audio URL available, show the error via the existing audio controls error area and do not present as playing."
        }
      ]
    }
  ]
}