{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Android WebView bridge: forward next/daily prayer times + city to window.AndroidPrayer for widgets",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "When location and prayer times are loaded, forward next prayer, daily prayer times, and city display name to the Android WebView bridge with values matching the UI (including offsets).",
      "acceptanceCriteria": [
        "With a location selected and prayer times loaded, the app triggers Android bridge calls containing next prayer name/time, all daily prayer times, and city/location display name.",
        "The payload values match what the app is currently showing (including any configured offsets).",
        "No bridge calls are attempted before prayer times are loaded (no errors in console due to undefined times)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/useNextPrayerCountdown.ts",
          "operation": "modify",
          "description": "Update the hook to emit Android bridge updates only after adjustedTimes is available, and to send the computed next prayer name + next prayer time (matching the UI’s HH:MM) through the centralized Android bridge utility (while preserving the existing timestamp-based widget update path for backward compatibility)."
        },
        {
          "path": "frontend/src/features/home/useAndroidWidgetUpdates.ts",
          "operation": "modify",
          "description": "Extend the hook to also send a city/location display name when available (in addition to existing daily/weekly widget updates), and ensure all payloads are derived from the already-adjusted prayer times so the values match the UI offsets."
        },
        {
          "path": "frontend/src/features/home/HomeTab.tsx",
          "operation": "modify",
          "description": "Wire location display name into the Android widget update hook (or equivalent bridge update call site) so city/location is sent only when a location is selected and prayer times are available, avoiding bridge calls during the no-location state."
        },
        {
          "path": "frontend/src/utils/androidBridge.ts",
          "operation": "modify",
          "description": "Add utility functions to send: (1) next prayer name + UI time string, (2) daily prayer times (imsak/fajr, gunes/sunrise, ogle/dhuhr, ikindi/asr, aksam/maghrib, yatsi/isha), and (3) city/location display name via the AndroidPrayer bridge when present, while keeping existing widget update behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement guarded Android-only JavaScriptInterface calls using window.AndroidPrayer.* without breaking normal browsers, with try/catch safety.",
      "acceptanceCriteria": [
        "In a normal desktop/mobile browser where `window.AndroidPrayer` is not present, the app continues to work with no runtime errors and no failed bridge calls.",
        "In Android WebView where `window.AndroidPrayer.updateNextPrayer` is present, the app calls it with the computed next prayer name and time.",
        "All Android bridge interactions are wrapped in safe checks/try-catch so unexpected native-side errors cannot crash the React app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/androidBridge.ts",
          "operation": "modify",
          "description": "Implement a guarded call path that invokes window.AndroidPrayer.updateNextPrayer(name, time) only when the AndroidPrayer interface exists, plus similarly guarded calls for daily prayer times and city info; wrap all native interactions with safe existence checks and try/catch so the React app cannot crash in non-Android browsers or on native-side exceptions."
        },
        {
          "path": "frontend/src/features/home/useNextPrayerCountdown.ts",
          "operation": "modify",
          "description": "Ensure next-prayer bridge calls are triggered only after prayer times are loaded and computed, and route the call through the guarded Android bridge utility so normal browsers never attempt native calls."
        },
        {
          "path": "frontend/src/features/home/useAndroidWidgetUpdates.ts",
          "operation": "modify",
          "description": "Route daily-times and city bridge sends through guarded Android bridge utility functions (or add equivalent safe checks in this hook) so non-Android browsers do not throw and native exceptions are safely contained."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the existing Android widget bridge script and TypeScript globals to support window.AndroidPrayer.* while keeping legacy window.Android.* and existing global widget functions working.",
      "acceptanceCriteria": [
        "`frontend/public/android-widget-bridge.js` exposes (or forwards to) `window.AndroidPrayer.updateNextPrayer(name, time)` when available, without removing existing `window.updateNextPrayerWidget`, `window.updateDailyPrayersWidget`, and `window.updateWeeklyPrayersWidget` behavior.",
        "TypeScript compilation succeeds with updated `frontend/src/androidWidgetBridge.d.ts` typings for any newly introduced `window.AndroidPrayer` surface used by the app.",
        "Existing widget update behavior (daily/weekly/next-prayer) continues to function in environments where only `window.Android.*` methods exist."
      ],
      "file_operations": [
        {
          "path": "frontend/public/android-widget-bridge.js",
          "operation": "modify",
          "description": "Augment the bridge to support a window.AndroidPrayer object that forwards updateNextPrayer(name, time), daily prayer times, and city/location info to native when available, while preserving backward compatibility with existing window.Android.updateNextPrayer/updateDailyPrayers/updateWeeklyPrayers and the existing global helpers window.updateNextPrayerWidget/window.updateDailyPrayersWidget/window.updateWeeklyPrayersWidget."
        },
        {
          "path": "frontend/src/androidWidgetBridge.d.ts",
          "operation": "modify",
          "description": "Extend global TypeScript declarations to include window.AndroidPrayer and its supported methods (next prayer, daily prayer times, city/location), and keep existing typings for window.updateNextPrayerWidget/updateDailyPrayersWidget/updateWeeklyPrayersWidget so TypeScript compilation remains green."
        },
        {
          "path": "frontend/src/utils/androidBridge.ts",
          "operation": "modify",
          "description": "Update the utility to prefer window.AndroidPrayer.* when available (with guards), while continuing to fall back to existing global widget bridge functions and/or window.Android.* methods so older Android WebViews remain supported."
        }
      ]
    }
  ]
}