{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Ramadan 30-day checklist to Fasting Tracker with local persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Ramadan (30 days) checklist section inside the existing Fasting Tracker tab with per-day toggles, progress, and a one-tap reset action.",
      "acceptanceCriteria": [
        "The Fasting Tracker tab includes a Ramadan checklist UI with exactly 30 individually toggleable day items (Day 1 … Day 30).",
        "Toggling a day immediately updates the displayed progress count.",
        "A reset/clear control is available to unmark all 30 days in one action (with a confirmation step or clearly safe UX).",
        "The Ramadan section does not interfere with existing 'voluntary' and 'make-up' fasting tracking features."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx",
          "operation": "create",
          "description": "Create a dedicated Ramadan (30 days) checklist section component that renders 30 toggleable day items, shows X/30 progress, and offers a reset action with a safe confirmation UX. Use existing warm-theme UI building blocks already used in the Fasting Tracker tab (e.g., Card/Badge/Button/Separator). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx",
          "operation": "modify",
          "description": "Wire the new RamadanChecklistSection into the existing Fasting Tracker tab without changing the current voluntary and make-up tracking behavior. Connect toggles/reset to the local settings state via useAppSettings so progress updates immediately. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist Ramadan checklist state in local settings and add forward-compatible localStorage migration for the new fields.",
      "acceptanceCriteria": [
        "Ramadan checklist completion state persists across page refreshes and app restarts.",
        "No runtime errors occur for existing users with older localStorage data; settings load successfully and new Ramadan fields default to an empty/unmarked state.",
        "Local settings versioning is incremented and older versions migrate without data loss for existing settings fields (location, offsets, adhkar, fasting dates, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/settings/appSettingsModel.ts",
          "operation": "modify",
          "description": "Extend the AppSettingsModel to include Ramadan 30-day checklist state (a stable representation that supports exactly 30 day toggles and future extension)."
        },
        {
          "path": "frontend/src/features/settings/useAppSettings.ts",
          "operation": "modify",
          "description": "Update DEFAULT_SETTINGS to include the new Ramadan checklist defaults (all 30 days unmarked) so the UI has safe initial values even before localStorage is populated."
        },
        {
          "path": "frontend/src/features/settings/localSettingsStorage.ts",
          "operation": "modify",
          "description": "Add the new Ramadan checklist fields to LocalSettings, increment STORAGE_VERSION, and implement a migration path from the current version to the new version that preserves all existing stored fields and safely defaults Ramadan days to unmarked when missing. Also ensure the post-load defaulting logic fills the Ramadan field when absent to prevent runtime errors."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the Ramadan checklist mobile-friendly and visually consistent with the app’s existing warm theme and Fasting Tracker styling.",
      "acceptanceCriteria": [
        "On small screens, the 30-day UI remains readable and usable without horizontal scrolling.",
        "Visual styling matches existing components used in the Fasting Tracker tab (Card/Badge/Button/etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/fasting-tracker/RamadanChecklistSection.tsx",
          "operation": "modify",
          "description": "Implement a compact responsive layout for 30 items (e.g., a grid/list that reflows on small screens and avoids horizontal scrolling) and match existing warm theme patterns (cards, badges, separators, button variants) used elsewhere in the Fasting Tracker. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/fasting-tracker/FastingTrackerTab.tsx",
          "operation": "modify",
          "description": "Position the Ramadan section within the existing tab flow using the same spacing and card structure as other sections, ensuring the overall page remains mobile-friendly and consistent. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}