{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Cuma Hutbesi: structured backend retrieval + faster, stable React Query UX",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Switch Cuma Hutbesi to the backend structured sermon methods and remove all browser-side HTML parsing/fetching; keep any new user-facing text in English (tab label remains “Cuma Hutbesi”).",
      "acceptanceCriteria": [
        "frontend/src/features/sermon/useLatestSermon.ts no longer uses DOMParser to find the sermon link from the listing HTML.",
        "Frontend no longer calls fetch(fullSermonUrl) to Diyanet from the browser (avoids CORS and long waits).",
        "Cuma Hutbesi tab shows loading skeleton quickly and then renders title/date/content from backend response.",
        "Any new error/loading/empty-state text introduced for this change is in English; the existing tab label remains exactly “Cuma Hutbesi”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/sermon/useLatestSermon.ts",
          "operation": "modify",
          "description": "Replace the current raw-HTML/DOMParser + browser fetch flow with calls to the backendInterface structured methods: use getLatestCachedSermon() for the main query result and provide a refresh function that triggers refreshAndGetLatestSermon() and updates the React Query cache. Ensure the returned data shape matches backend SermonData (optional title/date, required content) and remove any Diyanet URL construction or browser network calls."
        },
        {
          "path": "frontend/src/features/sermon/CumaHutbesiTab.tsx",
          "operation": "modify",
          "description": "Update the tab to use the revised hook API (structured data + explicit refresh action). Render title/date/content from the backend response and keep all newly introduced user-facing strings (e.g., empty state wording, refresh status text if added) in English while leaving the tab label “Cuma Hutbesi” unchanged."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Tune React Query caching/refetch behavior so sermon content stays visible during refetch and avoid unnecessary refetch loops on mobile.",
      "acceptanceCriteria": [
        "When the user taps Refresh/Retry, the UI indicates fetching without blanking already-displayed sermon content (if available).",
        "React Query caching settings prevent frequent refetches during normal navigation (staleTime and refetch behavior are set to mobile-friendly defaults).",
        "If the backend returns cached content quickly, the tab renders content without showing the error state seen previously."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/sermon/useLatestSermon.ts",
          "operation": "modify",
          "description": "Adjust React Query options for the sermon query to be mobile-friendly: keep prior data visible during background updates (e.g., placeholderData/keep-previous-data pattern), set an appropriate staleTime, and disable aggressive automatic refetch triggers (e.g., refetchOnWindowFocus/refetchOnMount) to prevent refetch loops. Ensure refresh uses an explicit action that updates the cache without clearing the displayed sermon."
        },
        {
          "path": "frontend/src/features/sermon/CumaHutbesiTab.tsx",
          "operation": "modify",
          "description": "Change loading/error rendering so that when a refetch/refresh is in progress and prior sermon data exists, the UI shows a fetching indicator (e.g., spinning icon/disabled button) without switching back to the full-page skeleton or blank state."
        }
      ]
    }
  ]
}