{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Seconds-inclusive next-prayer countdown (mm:ss) + AndroidPush payload sync",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update next-prayer countdown to recompute every second and format remaining time as mm:ss (or HH:mm:ss when >= 1 hour) using nextPrayerMillis.",
      "acceptanceCriteria": [
        "When the next-prayer time is in the future, the countdown value changes once per second in the UI state produced by the countdown hook.",
        "For remaining durations under 1 hour, the displayed remaining time uses a zero-padded mm:ss format (e.g., 04:09).",
        "For remaining durations of 1 hour or more, the displayed remaining time uses a zero-padded HH:mm:ss format (e.g., 01:04:09).",
        "The calculation uses the existing nextPrayerMillis target time and the current time, so seconds count down smoothly without skipping minutes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/formatRemainingTime.ts",
          "operation": "create",
          "description": "Add a small helper to format a remaining duration (computed from nextPrayerMillis - now) into zero-padded mm:ss (under 1 hour) or HH:mm:ss (1 hour or more), clamping negative values to 00:00 / 00:00:00 as needed."
        },
        {
          "path": "frontend/src/features/home/useNextPrayerCountdown.ts",
          "operation": "modify",
          "description": "Change countdown cadence from once-per-minute to once-per-second; compute remaining time from nextPrayerMillis and Date.now() each tick; replace minute-only/Turkish text remaining string with seconds-inclusive formatted value from formatRemainingTime; keep nextPrayer and nextPrayerMillis computation behavior intact."
        },
        {
          "path": "frontend/src/features/home/NextPrayerCountdown.tsx",
          "operation": "modify",
          "description": "Ensure the UI continues to display the new seconds-inclusive timeRemaining string without truncation and preserves numeric alignment (e.g., keep tabular-nums styling for stable per-second rendering)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Propagate the same seconds-inclusive countdown string into AndroidPush payload timeRemaining so the persistent notification can show mm:ss / HH:mm:ss.",
      "acceptanceCriteria": [
        "The JSON payload sent via `sendPrayerTimesToAndroidPush` includes `timeRemaining` in mm:ss (or HH:mm:ss) format matching the app countdown output.",
        "While the countdown is running, updates to `timeRemaining` can be observed propagating through the `useAndroidPushPrayerTimes` hook (i.e., no stale minute-only formatting remains)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/useAndroidPushPrayerTimes.ts",
          "operation": "modify",
          "description": "Confirm the payload composition continues to pass through the hook-provided timeRemaining value verbatim (now seconds-inclusive) and that deduplication does not retain any legacy minute-only formatting; keep payload field name `timeRemaining` unchanged."
        },
        {
          "path": "frontend/src/androidPushBridge.d.ts",
          "operation": "modify",
          "description": "Update interface documentation for AndroidPush payload field `timeRemaining` to reflect seconds-inclusive formats (mm:ss / HH:mm:ss) used by the web app countdown."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Prevent spamming legacy next-prayer bridge calls by keeping identity/timestamp bridge updates only on next-prayer changes, while allowing per-second countdown updates via AndroidPush payloads.",
      "acceptanceCriteria": [
        "`sendNextPrayerToAndroid` and `sendNextPrayerWithTimeString` are still invoked only when the next prayer (or its scheduled time) changes, not every second.",
        "No new per-second calls are added to the legacy next-prayer widget bridge functions beyond what is required for `timeRemaining` updates through AndroidPush payloads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/useNextPrayerCountdown.ts",
          "operation": "modify",
          "description": "Preserve and validate the existing dedup guards (lastSentTimestampRef / lastSentTimeStringRef) so sendNextPrayerToAndroid and sendNextPrayerWithTimeString fire only when nextPrayer identity or its scheduled time changes, even though the countdown tick runs every second."
        },
        {
          "path": "frontend/src/features/home/HomeTab.tsx",
          "operation": "modify",
          "description": "Verify wiring remains: useNextPrayerCountdown provides per-second timeRemaining to the UI and to useAndroidPushPrayerTimes, without adding any new per-second invocations of legacy widget bridge helpers in HomeTab."
        }
      ]
    }
  ]
}