{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Durable persisted location for Android WebView resilience",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Persist the user-selected location in a durable client-side store (IndexedDB) and treat it as the canonical saved location with localStorage as a secondary cache.",
      "acceptanceCriteria": [
        "After selecting a location, the app still shows the same selected location after closing and reopening the app.",
        "If localStorage is empty/cleared but the durable store still has the saved location, the app restores and uses that location automatically.",
        "If both stores are empty, the app behaves as today (location is null and user is prompted to select one)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/settings/durableLocationStorage.ts",
          "operation": "create",
          "description": "Add an IndexedDB-backed durable storage helper dedicated to persisting/restoring/clearing the saved Location (e.g., get/set/clear), to survive Android WebView localStorage cleanup."
        },
        {
          "path": "frontend/src/features/settings/localSettingsStorage.ts",
          "operation": "modify",
          "description": "Refactor local settings load/save helpers to support an async load path that can restore `settings.location` from the new durable IndexedDB store when localStorage is missing/cleared, while keeping current localStorage behavior as a fallback/secondary cache."
        },
        {
          "path": "frontend/src/features/settings/useAppSettings.ts",
          "operation": "modify",
          "description": "Update settings loading to await the async settings loader (including durable location restoration) and update settings saving so `location` changes are written to the durable store and localStorage, keeping the returned `settings.location` as the canonical saved value."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure location save completes (durable + localStorage) before UI closes or navigates in flows that depend on the saved location.",
      "acceptanceCriteria": [
        "When a user selects a location in the location picker, the dialog closes only after the save completes successfully.",
        "On immediate app refresh/reopen after selecting a location, the same location is loaded and displayed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/settings/useAppSettings.ts",
          "operation": "modify",
          "description": "Guarantee the mutation promise only resolves after durable storage write and localStorage write complete successfully, so callers can safely close dialogs/navigation only after `await saveSettings(...)` resolves."
        },
        {
          "path": "frontend/src/features/location/LocationSetupSection.tsx",
          "operation": "modify",
          "description": "Harden the location selection handler so the optional `onLocationSelected()` (which closes the dialog) only runs after the awaited save resolves, and ensure errors keep the dialog open and do not clear the user’s selection prematurely."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Unify all default-location update entry points to write the same persisted `settings.location`, keep temporary choices separate, and prevent accidental resets to null unless explicitly requested.",
      "acceptanceCriteria": [
        "Choosing “save as default” in any location search flow updates the same persisted `settings.location` used by Home/Prayer Times/Weather.",
        "Temporary location choices do not overwrite the persisted default location.",
        "No component sets `settings.location` to null unless the user explicitly performs a clear/reset action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/nearbymosque/NearbyMosqueTab.tsx",
          "operation": "modify",
          "description": "Ensure the “save as default” branch persists via `saveSettings({ location })` (thereby writing durable + localStorage) while the temporary branch only updates `tempLocation`, and confirm no implicit logic clears the persisted location when clearing the temporary selection."
        },
        {
          "path": "frontend/src/features/settings/useAppSettings.ts",
          "operation": "modify",
          "description": "Ensure the settings update flow never writes `location: null` unless explicitly asked (no implicit nulling during merges/migrations) and keep the default `settings.location` stable across mounts/tab switches by relying on the persisted stores."
        },
        {
          "path": "frontend/src/features/settings/localSettingsStorage.ts",
          "operation": "modify",
          "description": "Adjust settings merge/migration behavior so `location` is not overwritten to null/default when a durable location exists, and optionally backfill durable storage from localStorage when localStorage contains a location but durable storage is empty."
        }
      ]
    }
  ]
}