{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Namaz Öğretici: text-only single-page Men/Women flows (remove images + swipe UI)",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Replace the Namaz Öğretici step-by-step/swipe tutorial with a single scrollable, text-only page per gender (Men/Women).",
      "acceptanceCriteria": [
        "In the Namaz Öğretici tab, there are no swipe handlers, no pagination state (current step), no step dots, and no previous/next buttons rendered.",
        "For the selected gender (Men or Women), all tutorial steps are displayed in order on one long, scrollable page.",
        "Switching between Men and Women updates the page content immediately and does not cause any out-of-range/index errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx",
          "operation": "modify",
          "description": "Remove step pagination UI/logic (currentStep state, swipe/touch handlers, step dots, previous/next controls) and render all steps for the selected gender in order as a single scrollable text page (map through steps and display title/description and optional arabicText). Keep the existing gender selector and rakat counts sections intact."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Remove all tutorial images and any runtime dependency on Namaz tutorial image asset paths.",
      "acceptanceCriteria": [
        "Namaz Öğretici renders no step images in the UI.",
        "The app does not reference /assets/generated/namaz-*.png (or any step image filenames) from the Namaz Öğretici screen at runtime."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx",
          "operation": "modify",
          "description": "Remove the <img> rendering for steps and any remaining UI/layout assumptions tied to per-step images (e.g., aspect-square image container), ensuring the Namaz Öğretici screen never references tutorial image paths at runtime."
        },
        {
          "path": "frontend/src/features/namaz-ogretici/namazTutorialContent.ts",
          "operation": "modify",
          "description": "Remove all hard-coded tutorial image asset path values from menNamazSteps and womenNamazSteps so the Namaz Öğretici flow has no runtime dependency on /assets/generated/namaz-*.png."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Refactor namazTutorialContent.ts to a text-only step model without imagePath while keeping stable step ids and required text fields.",
      "acceptanceCriteria": [
        "The Namaz tutorial step type no longer requires an imagePath field.",
        "menNamazSteps and womenNamazSteps still export stable step ids and all text fields needed to render the single-page tutorial (title, description, and optional arabicText).",
        "Namaz Öğretici builds and renders successfully after the refactor without TypeScript errors related to removed image fields."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/namaz-ogretici/namazTutorialContent.ts",
          "operation": "modify",
          "description": "Update the NamazStep type to remove the imagePath field and refactor menNamazSteps/womenNamazSteps to match the new type while preserving existing step ids, ordering, and text fields (title, description, optional arabicText)."
        },
        {
          "path": "frontend/src/features/namaz-ogretici/NamazOgreticiTab.tsx",
          "operation": "modify",
          "description": "Update Namaz Öğretici rendering to use the refactored text-only step model (no imagePath usage) and ensure the single-page list rendering compiles cleanly with the updated types."
        }
      ]
    }
  ]
}