{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebuild Cuma Hutbesi tab UI states and React Query refresh behavior for stable latest-sermon display",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Rebuild/clean up the Cuma Hutbesi tab to show only the latest sermon with robust loading/error/empty states and a manual refresh action.",
      "acceptanceCriteria": [
        "The Cuma Hutbesi tab renders: (1) a loading skeleton on first load, (2) a readable error state with a retry button on failure, (3) an empty state with a load button if no data is available, and (4) the latest sermon title/date/content when available.",
        "Only the latest sermon is displayed; there is no archive/list of prior sermons.",
        "All user-facing text added/changed for this rebuild is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/sermon/CumaHutbesiTab.tsx",
          "operation": "modify",
          "description": "Clean up the tab rendering logic so it has explicit initial-loading skeleton, error-with-retry, empty-with-load, and content states; ensure the content view shows only the latest sermon (title/date/plain text) and that any updated/added user-facing copy is English (e.g., use an English fallback title instead of 'Cuma Hutbesi'). Continue composing existing shadcn-ui components (Button, Card, Skeleton) for consistent visuals; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Adjust React Query behavior so prior sermon content stays visible during refresh and prevent unnecessary refetch loops on mobile.",
      "acceptanceCriteria": [
        "When the user taps Refresh, the previous sermon content remains visible while the refresh is in progress (with a subtle ‘refreshing’ indicator), unless there is no prior sermon data.",
        "The query does not repeatedly refetch on mount/focus/reconnect beyond the configured behavior, and the tab does not get stuck in long loading states on subsequent opens.",
        "Manual refresh updates the cached query data so the UI updates immediately after refresh completes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/sermon/useLatestSermon.ts",
          "operation": "modify",
          "description": "Refactor the hook to use a dedicated React Query mutation (or equivalent) for manual refresh that updates the ['latestSermon'] cached data on success and exposes a stable 'isRefreshing' state for the UI. Tune cache timings (staleTime/gcTime) and keep refetchOnMount/focus/reconnect disabled to avoid refetch loops and long spinners on repeated tab opens."
        },
        {
          "path": "frontend/src/features/sermon/CumaHutbesiTab.tsx",
          "operation": "modify",
          "description": "Update the tab to rely on the hook’s refresh/mutation state so that existing sermon content stays rendered while refresh is in flight, and show a subtle inline 'Refreshing…' indicator (English) rather than replacing content with a blocking loading state. Continue composing existing shadcn-ui components for UI elements; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}