{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix location persistence in localStorage for mobile devices",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure manually selected location data persists in localStorage even after cache clearing on mobile devices",
      "acceptanceCriteria": [
        "Location data saved to localStorage with a dedicated key",
        "Location persists after browser cache is cleared",
        "Location persists after app is closed and reopened on mobile devices",
        "App loads and functions correctly with the saved location on restart"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/settings/durableLocationStorage.ts",
          "operation": "modify",
          "description": "Enhance IndexedDB persistence to use multiple storage strategies including localStorage, sessionStorage, and IndexedDB simultaneously. Add redundant storage writes to increase persistence reliability on mobile browsers. Implement a storage integrity check that verifies all storage locations contain valid location data."
        },
        {
          "path": "frontend/src/features/settings/localSettingsStorage.ts",
          "operation": "modify",
          "description": "Update the loadAppSettings and saveAppSettings functions to use the enhanced durableLocationStorage module for location data. Ensure location is saved to all available storage mechanisms (localStorage, sessionStorage, IndexedDB) on every write. Add recovery logic that attempts to read from all storage locations and uses the first valid location found."
        },
        {
          "path": "frontend/src/features/location/LocationSetupSection.tsx",
          "operation": "modify",
          "description": "Update the location save handler to call the enhanced storage functions that write to multiple storage locations. Add user feedback showing successful save confirmation. Ensure the component triggers storage integrity verification after save."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Enhance the location loading logic in useEffect to attempt recovery from all storage mechanisms (localStorage, sessionStorage, IndexedDB) on mount. Add fallback chain that tries each storage location in order until a valid location is found. Add console logging for debugging storage issues on mobile devices."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent app from crashing or becoming non-functional when cache is cleared",
      "acceptanceCriteria": [
        "App displays SelectLocationPrompt component when no location is available",
        "App does not crash or throw errors when localStorage is empty",
        "All prayer times, weather, and location-dependent features handle missing location gracefully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/HomeTab.tsx",
          "operation": "modify",
          "description": "Add null-safety checks for location state before rendering prayer times, weather, and countdown components. When location is null or undefined, display the SelectLocationPrompt component instead of attempting to fetch data. Ensure all useQuery hooks that depend on location are disabled when location is unavailable."
        },
        {
          "path": "frontend/src/features/prayer/usePrayerTimes.ts",
          "operation": "modify",
          "description": "Add enabled condition to the React Query that checks location is not null before attempting to fetch prayer times. Return null gracefully when location is unavailable instead of throwing errors."
        },
        {
          "path": "frontend/src/features/prayer/useWeeklyPrayerTimes.ts",
          "operation": "modify",
          "description": "Add enabled condition to the React Query that checks location is not null before attempting to fetch weekly prayer times. Return null gracefully when location is unavailable instead of throwing errors."
        },
        {
          "path": "frontend/src/features/weather/useWeather.ts",
          "operation": "modify",
          "description": "Add enabled condition to the React Query that checks location coordinates are available before attempting to fetch weather data. Return null gracefully when location is unavailable instead of throwing errors."
        },
        {
          "path": "frontend/src/features/prayer/PrayerTimesSection.tsx",
          "operation": "modify",
          "description": "Add early return that displays SelectLocationPrompt when location is null or undefined. Ensure the component does not attempt to render prayer times or kerahat times when location data is missing."
        },
        {
          "path": "frontend/src/features/weather/WeatherSection.tsx",
          "operation": "modify",
          "description": "Add early return that displays SelectLocationPrompt when location is null or undefined. Ensure the component does not attempt to render weather data when location is missing."
        },
        {
          "path": "frontend/src/features/weather/CompactWeatherSummary.tsx",
          "operation": "modify",
          "description": "Add null-safety checks to ensure the component renders nothing when location is unavailable, preventing errors during data fetching."
        },
        {
          "path": "frontend/src/features/home/useNextPrayerCountdown.ts",
          "operation": "modify",
          "description": "Add guards to prevent countdown calculation when prayer times are null or undefined. Return safe default values (null nextPrayer, empty timeRemaining) when data is unavailable."
        },
        {
          "path": "frontend/src/features/home/useSahurIftarCountdown.ts",
          "operation": "modify",
          "description": "Add guards to prevent countdown calculation when prayer times are null or undefined. Return safe default values when data is unavailable to prevent crashes."
        },
        {
          "path": "frontend/src/features/home/useCurrentPrayerSlot.ts",
          "operation": "modify",
          "description": "Add null-safety checks for prayerTimes before attempting to determine current prayer slot. Return null when prayer times are unavailable."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add fallback mechanism to provide a default location if localStorage is completely cleared",
      "acceptanceCriteria": [
        "Default location (Istanbul or similar) is defined as a constant",
        "Default location is used only when localStorage is empty and no selection has been made",
        "App displays prompt to encourage user to select their actual location",
        "Prayer times and weather data load correctly with the default location"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/location/types.ts",
          "operation": "modify",
          "description": "Add a constant DEFAULT_LOCATION defining Istanbul coordinates (41.0082° N, 28.9784° E) with a displayName indicating it is a default fallback location. Export this constant for use throughout the application."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the location loading logic to use DEFAULT_LOCATION when all storage mechanisms fail to return a valid location. Add a state flag to track whether the current location is the default fallback. Pass this flag to child components so they can display appropriate messaging."
        },
        {
          "path": "frontend/src/features/home/HomeTab.tsx",
          "operation": "modify",
          "description": "Accept an isDefaultLocation prop from App. When isDefaultLocation is true, display a prominent banner or alert encouraging the user to select their actual location. Ensure prayer times and weather still render using the default location data."
        },
        {
          "path": "frontend/src/features/settings/localSettingsStorage.ts",
          "operation": "modify",
          "description": "Update loadAppSettings to return DEFAULT_LOCATION as the location value when all storage recovery attempts fail and no location has ever been set. Ensure the default location is not persisted to storage automatically."
        },
        {
          "path": "frontend/src/components/SelectLocationPrompt.tsx",
          "operation": "modify",
          "description": "Update the prompt text to inform users when the app is using a default location. Add messaging that explains setting their actual location will improve accuracy of prayer times and weather data."
        }
      ]
    }
  ]
}