{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show 7-day prayer times on the Home page for the selected location",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new weekly prayer-times fetch utility + React Query hook (7 days) using Aladhan, keyed and enabled by selected location coordinates.",
      "acceptanceCriteria": [
        "When a location is selected, the app fetches prayer times for 7 consecutive days using Aladhan (same provider as current daily timings).",
        "The query is disabled when there is no selected location, and surfaces a user-friendly error state if the request fails.",
        "The React Query cache key includes the selected location coordinates so changing location refetches the 7-day data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/prayer/aladhanWeeklyApi.ts",
          "operation": "create",
          "description": "Create a new Aladhan-based data-fetching utility that retrieves and normalizes prayer times for today + the next 6 days using the selected location latitude/longitude and the same calculation method as the existing daily fetch. Ensure thrown errors intended for display are in English."
        },
        {
          "path": "frontend/src/features/prayer/useWeeklyPrayerTimes.ts",
          "operation": "create",
          "description": "Create a React Query hook wrapping the weekly fetch utility. Ensure the queryKey includes latitude/longitude, enabled is false when location is null, and failures can be surfaced as a user-friendly English message in the UI."
        },
        {
          "path": "frontend/src/features/prayer/aladhanApi.ts",
          "operation": "modify",
          "description": "Refactor/shared-constant extraction (if needed) to guarantee the weekly fetch uses the exact same Aladhan provider configuration as the existing daily fetch, without changing the daily behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render a Home page 7-day prayer times section (table/list) that matches existing styling, hides without location, and applies the configured time offset consistently.",
      "acceptanceCriteria": [
        "If no location is selected, the weekly section is not shown (the existing location setup UI remains the only prompt).",
        "When weekly data is available, the Home page displays 7 rows (one per day) and columns (or labeled fields) for at least: İmsak (Fajr), Güneş (Sunrise), Öğle (Dhuhr), İkindi (Asr), Akşam (Maghrib), Yatsı (Isha), plus the date/day label.",
        "The weekly display respects the user’s configured offset (settings.offsetMinutes) consistently across all shown times, using the same offset behavior as the existing daily Home list.",
        "Loading and error states are styled consistently with existing HomeTab patterns (e.g., muted loading text, destructive error text) and do not break layout on mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/home/WeeklyPrayerTimesSection.tsx",
          "operation": "create",
          "description": "Create a Home feature component that renders weekly prayer times in a table/list format consistent with HomeTab’s Card/MotifFrame design language. Use existing shadcn-ui components already present in the project (e.g., Card) to keep styling consistent; verify the component's usage instructions before implementing. Include mobile-safe horizontal handling (e.g., responsive layout) and styled loading/error states (muted/destructive) with any new user-facing text in English."
        },
        {
          "path": "frontend/src/features/home/HomeTab.tsx",
          "operation": "modify",
          "description": "Wire the new weekly hook + WeeklyPrayerTimesSection into the Home page after the existing daily prayer list (and before/around existing sections as appropriate). Only render the weekly section when a location exists (HomeTab already short-circuits), apply settings.offsetMinutes to every day’s times using the same offset utility behavior as the daily list, and pass through loading/error states for consistent styling."
        },
        {
          "path": "frontend/src/features/prayer/timeOffset.ts",
          "operation": "modify",
          "description": "Add/adjust helper typing or a small utility (if needed) to apply the existing offset behavior cleanly to each day in the 7-day dataset without changing current daily offset behavior."
        }
      ]
    }
  ]
}