{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T00:34:53.704Z",
  "summary": "Backend and frontend were updated to shift sermon loading to backend methods and improve UX with skeletons and React Query settings, but the backend implementation does not actually fetch/parse the latest sermon detail page, uses placeholder parsing logic, and caching lacks TTL/timestamp semantics required by the spec. A migration file was added but the backend does not show stable-state storage for the cache in the provided diff.",
  "missing_requirements": [
    {
      "id": "REQ-51",
      "requirement": "Backend method fully retrieves and parses the latest hutbe and returns structured {title, date, content} based on listing+detail HTTPS outcalls, with resilient parsing and clear errors on failure.",
      "reason": "The backend only fetches the listing URL and returns the listing HTML as `content` without performing a second outcall to the sermon detail page. Parsing logic appears stubbed: `findRegexMatch` returns the full input text for any non-empty HTML and `extractFirstMatch` returns the entire text, not the captured groups. This is neither a real parse of title/date nor resilient link discovery, and it does not parse the actual sermon content from the detail page.",
      "evidence": [
        "backend/main.mo (fetchAndParseLatestSermon only calls makeOutcall(listing URL); parseFirstSermonFromListing sets content=html; findRegexMatch/extractFirstMatch stub implementations)"
      ]
    },
    {
      "id": "REQ-52",
      "requirement": "Backend-side caching with timestamp and TTL, returning quickly from cache within TTL, and allowing refresh to bypass/revalidate.",
      "reason": "A cache variable exists (`latestSermonCache`) and there is a separate refresh method, but there is no timestamp stored and no TTL check/expiry logic implemented. Calls always return cached data indefinitely until refresh is called.",
      "evidence": [
        "backend/main.mo (var latestSermonCache : ?SermonData = null; getLatestCachedSermon returns cache without any TTL/timestamp; no timestamp field in SermonData)"
      ]
    },
    {
      "id": "REQ-50",
      "requirement": "Fix the Diyanet listing URL used by the backend sermon fetch so it matches the provided URL exactly and is not double-URL-encoded; existing listing fetch returns valid HTML (not redirect/error).",
      "reason": "The exact URL string is present, but the diff summary does not provide evidence that the existing backend listing-fetch method (the pre-existing method referenced in the requirement) was fixed/updated, nor does it show any validation that the response is the correct listing HTML (as opposed to a redirect/error page). The new fetch path uses the URL, but AC mentions the existing method specifically.",
      "evidence": [
        "backend/main.mo (new fetchAndParseLatestSermon uses the URL; no other listing-fetch method shown/updated in diff summary)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added backend upgrade migration introducing `latestSermonCache` in migrated state, despite no clear evidence in backend/main.mo that the cache is stored as stable state requiring a migration.",
      "reason": "A migration file was added and wired via `(with migration = Migration.run)`, and `backend/migration.mo` adds `latestSermonCache` to actor state. However, the provided backend/main.mo diff only shows an in-memory `var latestSermonCache` and does not show stable-state persistence (e.g., `stable var` or preupgrade/postupgrade handling). This suggests an upgrade migration may be unnecessary or incomplete relative to the change.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo ((with migration = Migration.run); var latestSermonCache : ?SermonData = null;)"
      ]
    }
  ],
  "confidence": 0.68,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/features/sermon/CumaHutbesiTab.tsx",
    "frontend/src/features/sermon/useLatestSermon.ts",
    "project_state.json"
  ]
}