{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-14T23:30:31.447Z",
  "summary": "BuildRequest specified no requirements and explicitly stated a non-goal of implementing new features without an explicit request. The diff adds multiple new backend features (profiles, settings, sermon cache structures, app release tracking, and authorization checks), which appear unrequested.",
  "missing_requirements": [],
  "hallucinated_features": [
    {
      "description": "Added user profile storage and related APIs (get/save caller profile, get profile by principal) with authorization checks.",
      "reason": "BuildRequest lists no requirements and explicitly says not to implement new features without an explicit request.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Added app settings storage and related APIs (get/save caller settings, get settings by principal) with authorization checks.",
      "reason": "Not requested; BuildRequest includes 'Requirements: none' and a non-goal to avoid new features.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Introduced sermon-related types and in-memory caches (SermonData, WeeklySermon, sermonCache, cacheUrls).",
      "reason": "Not requested; BuildRequest non-goal explicitly mentions not implementing sermon fetching/features without an explicit request.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Added app release tracking (AppRelease type, latestAppRelease state, updateLatestAppRelease admin-only method, getLatestAppRelease).",
      "reason": "Not requested; BuildRequest indicates no new features should be implemented.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Added/introduced access control state initialization and included MixinAuthorization in the backend actor.",
      "reason": "No requirement requested authorization refactors or new authorization behavior; could be a new feature/change beyond scope given 'Requirements: none'.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.78,
  "changed_files": [
    "backend/main.mo",
    "project_state.json"
  ]
}