{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T10:27:59.183Z",
  "summary": "Frontend Cuma Hutbesi tab and React Query behavior were rebuilt with loading/error/empty states and a manual refresh flow that keeps prior data visible while refreshing. Backend shows new caching structs and a Friday-10AM check helper, plus a migration module, but the diff summary does not show the required end-to-end Diyanet listing→detail parsing and plain-text extraction pipeline, nor clearly demonstrates Turkey-time weekly refresh behavior wired into the public endpoints.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Backend must parse the Diyanet Turkish listing page to find the latest sermon detail URL, fetch the detail page, and return structured SermonData with plain-text content (not listing HTML), trapping with a clear error if parsing fails.",
      "reason": "The diff summary for backend/main.mo shows HTTP GET helper(s) and cache types, but does not show logic that (a) parses the listing HTML to extract the latest detail link, (b) fetches the detail page, or (c) extracts/cleans sermon text into plain text. No trap/error messages for “no link found / format changed” are evidenced.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Backend must implement weekly Friday 10:00 (Turkey time) cache invalidation/refresh on the first request after that time, while keeping a manual refresh endpoint that always forces refresh.",
      "reason": "A helper `isPastFridayTenAM` exists, but the diff summary does not show (1) Turkey-time handling, (2) how the cached metadata is used to decide “current week’s post-Friday-10:00 refresh window”, or (3) that `getLatestCachedSermon` triggers refresh on first request after the cutoff. The shown calculation uses a simple modulo of 7 days and does not evidence Turkey time-zone alignment.",
      "evidence": [
        "backend/main.mo (truncated): isPastFridayTenAM",
        "frontend/src/features/sermon/useLatestSermon.ts (calls actor.getLatestCachedSermon / actor.refreshAndGetLatestSermon)"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Backend must ensure sermon content is delivered as plain text by extracting from the sermon detail HTML, and only attempt DOC/DOCX parsing if feasible without external services; if DOC/DOCX conversion isn’t feasible, still return plain text from HTML.",
      "reason": "No DOC/DOCX handling nor HTML-to-plain-text extraction/cleanup is shown in the diff summary; only generic HTTP GET helpers and cache structs are visible.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added a canister migration module that maps an old actor state to a new empty actor state.",
      "reason": "The BuildRequest does not ask for state migration or removal of stable variables; this is additional functionality outside the requested sermon fetching/UI rebuild scope.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo (truncated): (with migration = Migration.run)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend/src/features/sermon/CumaHutbesiTab.tsx",
    "frontend/src/features/sermon/useLatestSermon.ts",
    "project_state.json"
  ]
}